time_set=1.5
import random
numberrandom = (random.randint(1,5))
import tkinter as tk
if numberrandom == 1 or numberrandom == 2:
    window=tk.Tk()
    window.title( '上海地铁查询器V.22.4.29测试版')
    var=tk.StringVar()
    l = tk.Label(window,
        textvariable=var,
        bg='yellow',
        width=50, height=2)
    l.pack()
    on_hit=False
    def hit_me( ):
        global on_hit
        if on_hit==False:
            on_hit=True
            var.set( '欢迎加入测试组！上海地铁查询器测试频道 频道号:43vwp0za5m' )
        else:
            on_hit=False
            var.set( '')
    b=tk.Button(window,text='加入测试组' ,width=15,height=2,command=hit_me)
    b.pack()
    window.mainloop()
import time
print('加载中，请稍等...')
print()
time.sleep(random.randint(1, 2))
print('欢迎使用上海地铁查询器电脑版！您使用的地铁计算器的版本号：V.22.4.29（临时正式版本）')
print()
print('声明：本软件免费提供给上海地铁爱好者查询车号和特殊性。本软件不可作为商业用途，不要相信各种付费的上海地铁车体号计算器，发现请向制作人反馈，谢谢配合。')
print()
print('您的咨询账号：382344329743，如您需咨询制作人（rain02095@qq.com），需要注明，否则不予回复。联系时请在附件内写明文件内容，不能更改文件名，但可以更改后缀。')
print()
print('关于我们：我们只是一些上海地铁爱好者。')
print()
print('在您使用之前，请先阅读以下内容：1.如果您有什么意见或建议，希望向制作人提出。您的反馈和建议使我们变得更好。2.在使用之前，请关闭包括Windows安全中心和360安全卫士在内的所有杀毒软件，有使用者向制作人反馈杀毒软件会误报导致自动隔离，制作者也经历过软件使用时被杀毒软件误报后自动删除的经历，无法使用此软件。谢谢您的配合。')
print()
print('SATCO代表上阿，本软件一切内容源于@wxy&alstomfish的表格，遵循原表不再更改，下面不再显示。')
print()
time.sleep(0.1)
m = 0
while True:
    print('您需要使用的软件模式是1.帮助模式 2.查询车体号模式 3.查询车号模式 4.个性化设置 5.设置 6.用户协议 7.更新日志 8. 退出软件，如果您输入的是查询车体号模式，请跳过本步骤直接进入下一步（按回车）；其他需求输入相应数字即可。')
    m = input()
    if not m == '1' and not m == '2' and not m == '4' and not m == '8' and not m == '5' and not m == '6' and not m =='3' and not m=='7':
          
        print()
        time.sleep(0.1)
        a = input('请输入车体号：')
        print('搜寻结果中...')
        time.sleep(0.5)
        print()
    else:
        a = '什么都没有哦~~'
        
    b = list(a)
    try:
        abc = int(b[4])
        abcd = int(b[3] + b[4])
        abcde = int(b[3] + b[4] + b[5])
        abcdef = b[3] + b[4] + b[5]
    except:
        pass
    try:
        lastone=int(b[7])
    except:
        pass
    d = 0
    #老老八
    a1_list = ['92011', '92022', '92033', '93442', '93453', '94102', '94113', '94121']
    a2_list = ['93121', '93262', '93273', '14652', '14663', '92102', '93233', '93311']
    a3_list = ['92131', '92142', '92153', '94022', '94033', '92162', '92173', '92181']
    a4_list = ['92191', '92202', '92213', '94202', '94213', '92222', '92233', '92241']
    a5_list = ['93011', '93022', '93033', '94162', '94173', '93042', '93053', '93061']
    a6_list = ['92061', '92053', '92042', '94053', '94042', '94093', '94082', '94071']
    a7_list = ['93251', '93142', '93153', '93462', '93473', '93282', '93173', '92121']
    a8_list = ['93191', '93202', '93213', '94142', '94153', '93222', '92113', '93361']
    a9_list = ['93251', '93322', '93333', '93402', '93413', '93162', '93293', '93301']
    a10_list = ['93181', '93353', '93342', '94233', '94222', '92093', '92082', '92071']
    a14_list = ['93071', '93082', '93093', '93382', '93393', '93102', '93113', '93241']
    #伪八二世
    a11_list = ['93371', '014352', '014363', '014372', '014383', '014392', '014403', '93421']
    a12_list = ['93431', '014412', '014423', '014432', '014443', '014453', '014463', '93481']
    a13_list = ['94011', '014472', '014483', '014492', '014503', '014512', '014523', '94061']
    a15_list = ['94131', '014532', '014543', '014552', '014563', '014578', '014583', '94181']
    a16_list = ['94191', '014592', '014603', '014612', '014623', '014632', '014643', '94241']
    #老八
    a17_list = ['98011', '98022', '98033', '14672', '14683', '98042', '98053', '98061']
    a18_list = ['99011', '99022', '99033', '01802', '01813', '99042', '99053', '99061']
    a19_list = ['99071', '99082', '99093', '01822', '01833', '99102', '99113', '99121']
    a20_list = ['99131', '99142', '99153', '99500', '99512', '99163', '91173', '99181']
    a21_list = ['99191', '99202', '99213', '99522', '99533', '99222', '99233', '99241']
    a22_list = ['99351', '99262', '99273', '00023', '00033', '99282', '99293', '99301']
    a23_list = ['99311', '99322', '99333', '00042', '00053', '99342', '99353', '99361']
    a24_list = ['99371', '99382', '99393', '01742', '01753', '99402', '99413', '99421']
    a25_list = ['99431', '99442', '99453', '01762', '01773', '99462', '99473', '99481']
    #伪八
    a26_list = ['99491', '013682', '013673', '013663', '013652', '013643', '013632', '99541']
    a27_list = ['00011', '013802', '013793', '013783', '013772', '013763', '013758', '00061']
    a28_list = ['01731', '013862', '013853', '013843', '013832', '013823', '013812', '01781']
    a29_list = ['01791', '013742', '013733', '013783', '013712', '013703', '013692', '01841']
    a30_list = ['01351', '013992', '014003', '014012', '014033', '014033', '014042', '01301']
    a31_list = ['01311', '014172', '014183', '014192', '014203', '014213', '014222', '01361']
    a32_list = ['01371', '014232', '014243', '014252', '014263', '014273', '014282', '01421']
    a33_list = ['01431', '014112', '014123', '014132', '014143', '014153', '014162', '01481']
    a34_list = ['01491', '014052', '014063', '014072', '014083', '014093', '014102', '01541']
    a35_list = ['01551', '013872', '013883', '013892', '013903', '013913', '013922', '01601']
    a36_list = ['01611', '013932', '013943', '013952', '013963', '013973', '013982', '01661']
    a37_list = ['01671', '014292', '014303', '014312', '014323', '014333', '014342', '01721']
    #西瓜
    b01_list = ['00071', '00082', '00093', '01262', '01273', '00102', '00113', '00121']
    b02_list = ['00131', '00142', '00153', '01282', '01293', '00162', '00173', '00181']
    b03_list = ['00191', '00202', '00213', '01322', '01333', '00222', '00233', '00241']
    b04_list = ['00251', '00262', '00273', '01342', '01353', '00282', '00293', '00301']
    b05_list = ['00311', '00322', '00333', '01382', '01393', '00342', '00353', '00361']
    b06_list = ['00371', '00382', '00393', '01402', '01413', '00402', '00413', '00421']
    b07_list = ['00431', '00442', '00453', '01442', '01453', '00462', '00473', '00481']
    b08_list = ['00491', '00502', '00513', '01462', '01473', '00522', '00533', '00541']
    b09_list = ['00551', '00562', '00573', '01502', '01513', '00582', '00593', '00601']
    b10_list = ['00611', '00622', '00633', '01522', '01533', '00642', '00653', '00661']
    b11_list = ['00671', '00682', '00693', '01562', '01573', '00702', '00713', '00721']
    b12_list = ['00731', '00742', '00753', '01582', '01593', '00762', '00773', '00781']
    b13_list = ['01011', '01022', '01033', '01622', '01633', '01042', '01053', '01061']
    b14_list = ['01071', '01082', '01093', '01642', '01653', '01102', '01113', '01121']
    b15_list = ['01131', '01142', '01153', '01682', '01693', '01162', '01173', '01181']
    b16_list = ['01191', '01202', '01213', '01702', '01713', '01222', '01233', '01241']
    #黄鱼
    c01_list = ['02011', '02022', '02033', '02043', '02052', '02061']
    c02_list = ['02071', '02082', '02093', '02103', '02112', '02121']
    c03_list = ['02131', '02142', '02153', '02163', '02172', '02181']
    c04_list = ['02191', '02202', '02213', '02223', '02232', '02241']
    c05_list = ['02251', '02262', '02273', '02283', '02292', '02301']
    c06_list = ['03011', '03022', '03033', '03043', '03052', '03061']
    c07_list = ['03071', '03082', '03093', '03103', '03112', '03121']
    c08_list = ['03131', '03142', '03153', '03163', '03172', '03181']
    c09_list = ['03191', '03202', '03213', '03223', '03232', '03241']
    c10_list = ['03251', '03262', '03273', '03283', '03292', '03301']
    c11_list = ['03311', '03322', '03333', '03343', '03352', '03361']
    c12_list = ['03371', '03382', '03393', '03403', '03412', '03421']
    c13_list = ['03431', '03442', '03453', '03463', '03472', '03481']
    c14_list = ['03491', '03502', '03513', '03523', '03532', '03541']
    c15_list = ['03551', '03562', '03573', '03583', '03592', '03601']
    c16_list = ['03611', '03622', '03633', '03643', '03652', '03661']
    c17_list = ['03671', '03682', '03693', '03703', '03712', '03721']
    c18_list = ['03731', '03742', '03753', '03763', '03772', '03781']
    c19_list = ['03791', '03802', '03813', '03823', '03832', '03841']
    c20_list = ['03851', '03862', '03873', '03883', '03892', '03901']
    c21_list = ['03911', '03922', '03933', '03943', '03952', '03961']
    c22_list = ['04011', '04022', '04033', '04043', '04052', '04061']
    c23_list = ['04071', '04082', '04093', '04103', '04121', '04112']
    c24_list = ['04131', '04142', '04153', '04163', '04172', '04181']
    c25_list = ['04191', '04202', '04213', '04223', '04232', '04241']
    c26_list = ['04251', '04262', '04273', '04283', '04292', '04301']
    c27_list = ['04311', '04322', '04333', '04343', '04352', '04361']
    c28_list = ['04371', '04382', '04393', '04403', '04412', '04421']
    #番茄炒蛋
    e01_list = ['052011', '052022', '052032', '052041']
    e02_list = ['053011', '053022', '053032', '053041']
    e03_list = ['053051', '053062', '053072', '053081']
    e04_list = ['053091', '053102', '053112', '053121']
    e05_list = ['053131', '053142', '053152', '053161']
    e06_list = ['053171', '053182', '053192', '053201']
    e07_list = ['053211', '053222', '053232', '053241']
    e08_list = ['053251', '053262', '053272', '053281']
    e09_list = ['053291', '053302', '053312', '053321']
    e10_list = ['053331', '053342', '053352', '053361']
    e11_list = ['053371', '053382', '053392', '053401']
    e12_list = ['054011', '054022', '054032', '054041']
    e13_list = ['054051', '054062', '054072', '054081']
    e15_list = ['054131', '054142', '054152', '054161']
    e16_list = ['054171', '054182', '054192', '054201']
    e17_list = ['054211', '054222', '054232', '054241']
    e18_list = ['054091', '054102', '054112', '054121']
    try:
        ab = int(a[-1])
        y = int(b[2] + b[3] +b[4])
        u = int(b[2] + b[3])
        if len(b) == 7:
            w = int(b[3] + b[4] +b[5])
        if len(b) == 8:
            v = int(b[4] + b[5] + b[6])

        x = b[0] + b[1]
    except:
        ab = 0
        y = 0
        w = 0
        v = 0
        cv = 0
        x = 0
    def a38():
        global a
        global b
        global y
        global d
        dd = None
        ddd = []
        
        b = list(a)
        if (y - 234) % 8 == 0:
            d = (y - 234) // 8 + 39
        else:
            d = (y - 234) // 8 + 39+1
        print('车号：01' + str(d) + '，代号：01A05胖头鱼，线路：01')
        if d == 40:
            print('特殊性：曾为备件车')
        elif d == 41:
            print('特殊性：左上角有编号、首列交付且上线')
        elif d == 50:
            print('特殊性：上海火车站事故车')
        elif d == 53:
            print('特殊性：最后一列上线')
        if d == 38 or d == 39:
            print('组装：浦镇')
        elif d == 54 or d == 55:
            print('组装：SATCO')
        elif d % 2 == 0:
            print('组装：SATCO')
        elif d % 2 == 1:
            print('组装：浦镇')
        print('上线：2007')
    def a56():
        b = list(a)
        if (y - 467) % 8 == 0:
            d = (y - 467) // 8 + 55
        else:
            d = (y - 467) // 8 + 55+1
        
        print('车号：01' + str(d) + '，代号：01A06钢铁侠，线路：01')
        if d == 56:
            print('特殊性：首列上线的钢铁侠')
        elif d == 57:
            print('特殊性：首列交付的钢铁侠')
        elif d == 58:
            print('特殊性：最后一列交付')
        elif d == 59:
            print('特殊性：最后一列上线')
        if d == 56 or d == 58 or d == 59 or d == 63:
            print('上线：2017')
        else:
            print('上线：2018')
    def a67():
        b = list(a)
        if (y - 467) % 8 == 0:
            d = (y - 467) // 8 + 55
        else:
            d = (y - 467) // 8 + 55+1
        print('车号：010' + str(d) + '，代号：01A07钢铁侠二世，线路：01')
        if d == 67:
            print('特殊性：最后一列交付')
        elif d == 69:
            print('特殊性：首列交付且上线')
        if d == 67 or d == 68 or d == 82 or d == 84 or d == 85 or d == 86:
            print('上线：2020')
        else:
            print('上线：2019')
        
    def b33():
        b = list(a)
        if y % 8 == 0:
            d = y // 8 + 16
        else:
            d = y // 8 + 16+1
        print('车号：02' + str(d) + '，代号：02A02青鱼，线路：02')
        if d == 34:
            print('特殊性：第一列交付且上线的青鱼')
        elif d == 38:
            print('特殊性：曾为备件车')
        elif d == 43:
            print('特殊性：纪念汶川地震曾改涂黑鱼')
        elif d == 52:
            print('特殊性：曾为备件车')
        if d == 52 or d == 53:
            print('组装：SATCO')
        elif d % 2 == 0:
            print('组装：SATCO')
        elif d % 2 == 1:
            print('组装：浦镇')
        if d < 51:
            print('上线：2008')
        else:
            print('上线：2009')
    def b54():
        b = list(a)
        if y % 8 == 0:
            d = y // 8 + 16
        else:
            d = y // 8 + 16+1
        print('车号：02' + str(d) + '，代号：02A03鲶鱼，线路：02')
        if d == 55:
            print('特殊性：第一列交付，最后一列上线的鲶鱼')
        elif d == 56:
            print('特殊性：023131、023142、023153、023201曾被拆为4节小鲶鱼')
        elif d == 64:
            print('特殊性：第一列上线')
        if d < 62:
            print('组装：浦镇')
        elif d > 61:
            print('组装：SATCO')
        if d == 55:
            print('上线：2014')
        elif d == 60:
            print('上线：2013')
        elif d == 54 or d == 59 or d == 61 or d > 66:
            print('上线：2012')
        else:
            print('上线：2010')
    def b70():
        b = list(a)
        if y % 4 == 0:
            d = y // 4 - 37
        else:
            d = y // 4 - 37+1
        print('车号：02' + str(d) + '，代号：02A04扩编鲶鱼，原小鲶鱼，线路：02')
        if d == 74:
            print('特殊性：首列改造且改后首列上线')
        elif d == 78:
            print('首列上线')
        if d < 78:
            print('组装：浦镇')
        elif d > 77:
            print('组装：SATCO')
        if d == 71:
            print('上线：2011')
        elif d == 72 or d == 78:
            print('上线：2010/2020')
        elif d == 74 or d == 84:
            print('上线：2010/2018')
        elif d == 75:
            print('上线：2020/2019')
        else:
            print('上线：2010')
    def b702():
        b = list(a)
        if y % 4 == 0:
            d = y // 4 - 53
        else:
            d = y // 4 - 53+1
        print('车号：02' + str(d) + '，代号：02A04扩编鲶鱼，新车厢，线路：02')
        if d == 74:
            print('特殊性：首列改造且改后首列上线')
        elif d == 78:
            print('特殊性：首列上线')
        if d == 74:
            print('特殊性：首列改造且改后首列上线')
        elif d == 78:
            print('首列上线')
        if d < 78:
            print('组装：浦镇')
        elif d > 77:
            print('组装：SATCO')
        if d == 71:
            print('上线：2011')
        elif d == 72 or d == 78:
            print('上线：2010/2020')
        elif d == 74 or d == 84:
            print('上线：2010/2018')
        elif d == 75:
            print('上线：2020/2019')
        else:
            print('上线：2010')
    def b86():
        b = list(a)
        if y % 8 == 0:
            d = y // 8 + 16
        else:
            d = y // 8 + 16+1
        if d < 100:
            print('车号：020' + str(d) + '，代号：02A05绿灯侠，线路：02')
        elif d > 99:
            print('车号：02' + str(d) + '，代号：02A05绿灯侠，线路：02')
        if d == 86:
            print('特殊性：首列交付')
        elif d == 88:
            print('特殊性：拥有上海地铁第5000节车厢，首列上线')
        if d > 87 and d < 94:
            print('上线：2019')
        elif d > 95 and d < 100:
            print('上线：2019')
        elif d > 106 and d < 110:
            print('上线：2019')
        elif d == 102:
            print('上线：2019')
        else:
            print('上线：2020')
    def c01():
        
        global d
        b = list(a)
        
        
        if x == '02':
            if u % 6 == 0:
                d = u // 6
            else:
                d = u // 6 + 1
            
        elif x == '03':
            if u % 6 == 0:
                d = u // 6 + 5
            else:
                d = u // 6 + 5 + 1
        elif x == '04':
            if u % 6 == 0:
                d = u // 6 + 21
            else:
                d = u // 6 + 21 + 1
        try:
            if d < 10:
                print('车号：30' + str(d) + '，代号：03A01黄鱼，线路：03')
            else:
                print('车号：3' + str(d) + '，代号：03A01黄鱼，线路：03')
            if d == 1 or d == 2:
                print('特殊性：法国进口列车')
            elif d == 3:
                print('特殊性：曾为备件车')
            elif d == 26:
                print('特殊性：曾为备件车')
            if d < 16:
                print('上线：2003')
            else:
                print('上线：2014')
            e01()
        except:
            print('没有找到车体号')
            e01()
    def c29():
        b = list(a)
        if y % 6 == 0:
            d = y // 6
        else:
            d = y // 6 + 1
        print('车号：03' + str(d) + '，代号：03A02黑包公，线路：03')
        if d == 30:
            print('特殊性：第一列交付且上线')
        elif d == 33:
            print('特殊性：贴纸在窗户上')
        elif d == 35:
            print('特殊性：曾临时借给4号线')
        if d < 33:
            print('组装：长客')
        elif d > 32:
            print('组装：SATCO')
        if d < 35:
            print('上线：2015')
        else:
            print('上线：2016')
    def d01():
        b = list(a)
        if y % 6 == 0:
            d = y // 6
        else:
            d = y // 6 + 1
        if d < 10:
            if d == 0:
                d == 1
            print('车号：040' + str(d) + '，代号：04A01奶嘴，线路：04')
        elif d > 9:
            print('车号：04' + str(d) + '，代号：04A01奶嘴，线路：04')
        print('0421——0428曾经借给2号线，编号0225——0232，以下特殊性不再注明')
        if d == 1 or d == 2:
            print('特殊性：进口列车，其余均在株机组装')
        elif d == 5:
            print('特殊性：曾为张江实训车')
        elif d == 24:
            print('特殊性：曾为备件车')
        elif d == 28:
            print('特殊性：拥有上海地铁第1000节车厢')
        if d < 21:
            print('上线：2005')
        elif d == 24 or d == 23:
            print('上线：2009')
        else:
            print('上线：2008')
    def d29():
        b = list(a)
        
        if y % 6 == 0:
            d = y // 6
        else:
            d = y // 6 + 1
        if d < 37 or d > 49:
            print('车号：04' + str(d) + '，代号：04A02,黑包公，线路：04')
        else:
            print('车号：03/04' + str(d) + '，代号：03A03/04A02,黑包公/叛徒包公，线路：03/04')
        if d == 29:
            print('特殊性：贴纸在窗户上')
        elif d == 30:
            print('特殊性：第一列交付且上线')
        elif d == 38:
            print('特殊性：第一列上线')
        elif d == 48:
            print('特殊性：最后一列上线')
        elif d == 55:
            print('特殊性：最后一列交付且上线')
        if d == 29:
            print('组装：长客')
        elif d > 29:
            print('组装：SATCO')
        if d == 50:
            print('上线：2018')
        elif d == 55:
            print('上线：2019')
        elif d < 33:
            print('上线：2015')
        elif d < 50:
            print('上线：2016')
        elif d > 50 and d < 55:
            print('上线：2017')
    def e01():
        b = list(a)
        
        global d
        
        if x == '02':
            if u % 4 == 0:
                d = u // 4
            else:
                d = u // 4 + 1
            
            
        elif x == '03':
            if u % 4 == 0:
                d = u // 4 + 1
            else:
                d = u // 4 + 1 + 1
         
        elif x == '04':
            if u % 4 == 0:
                d = u // 4 + 11
            else:
                d = u // 4 + 11 + 1
         
        try:
            if d == 14:
                d = 18
            if d < 10:
                print('车号：50' + str(d) + '，代号：05A01番茄炒蛋，线路：05')
            else:
                print('车号：5' + str(d) + '，代号：05A01番茄炒蛋，线路：05')
            if d == 1:
                print('特殊性：阿尔斯通进口列车')
                print('上线：2003')
            elif d == 18:
                print('特殊性：推算编号应为514')
        except:
            print('未找到车体号')
        
    def e19():
        b = list(a)
        if (y - 18) % 6 == 0:
            abc = (y - 18) //6
        else:
            abc = (y - 18) // 6+1
        d = abc + 18
        print('车号：05' + str(d) + '，代号：05C02紫罗兰，线路：05')
        if d == 19:
            print('特殊性：首列交付')
        elif d == 25:
            print('特殊性：平庄公路事故车、含修复车厢，最后一列上线')
        elif d == 51:
            print('特殊性：最后一列交付')
        print('组装：SATCO')
        if d == 25 or d == 40 or d > 47:
            print('上线：2019')
        else:
            print('上线：2018')
    #6
    def f01():
        b = list(a)
        if y % 4 == 0:
            d = y // 4
        else:
            d = y // 4 + 1
        if d == 00:
            d = int('01')
        print('车号：060' + str(d) + '，代号：06C01Kitty，线路：06')
        if d == 1:
            print('特殊性：首列交付')
        print('上线：2007')
    def f05():
        b = list(a)
        if y % 4 == 0:
            d = y // 4 + 1
        else:
            d = y // 4 + 2
        if d < 10:
            print('车号：060' + str(d) + '，代号：06C01Kitty，线路：06')
        else:
            print('车号：06' + str(d) + '，代号：06C01Kitty，线路：06')
        if d == 6:
            print('特殊性：曾为备件车')
        print('上线：2007')
    def f15():
        b = list(a)
        if y % 4 == 0:
            d = y // 4 + 2
        else:
            d = y // 4 + 3
        print('车号：06' + str(d) + '，代号：06C01Kitty，线路：06')
        if d < 18:
            print('上线：2007')
        else:
            print('上线：2008')
            
    def f25():
        b = list(a)
        if y % 4 == 0:
            d = y // 4 + 3
        else:
            d = y // 4 + 4
        print('车号：06' + str(d) + '，代号：06C02纸花木兰，线路：06')
        if d == 25:
            print('特殊性：首列交付且上线')
        if d > 24 and d < 28:
            print('组装：长客')
        elif d % 2 == 0:
            print('组装：SATCO')
        elif d % 2 == 1:
            print('组装：长客')
        print('上线：2009')
    def f35():
        b = list(a)
        if y % 4 == 0:
            d = y // 4 + 4
        else:
            d = y // 4 + 5
        print('车号：06' + str(d) + '，代号：06C02纸花木兰，线路：06')
        print('组装：SATCO')
        if d < 32:
            print('上线：2009')
        else:
            print('上线：2010')
    def f37():
        b = list(a)
        if y % 4 == 0:
            d = y // 4 + 4
        else:
            d = y // 4 + 5
        print('车号：06' + str(d) + '，代号：06C03电花木兰，线路：06')
        if d == 37:
            print('特殊性：首列交付')
        elif d == 38:
            print('特殊性：首列上线')
        print('组装：SATCO')
        if d < 40:
            print('上线：2012')
        else:
            print('上线：2013')
    def f45():
        b = list(a)
        if y % 4 == 0:
            d = y // 4 + 5
        else:
            d = y // 4 + 6
        print('车号：06' + str(d) + '，代号：06C03电花木兰，线路：06')
        print('组装：SATCO')
        print('上线：2013')
    def f55():
        b = list(a)
        if y % 4 == 0:
            d = y // 4 + 6
        else:
            d = y // 4 + 7
        print('车号：06' + str(d) + '，代号：06C03电花木兰，线路：06')
        print('组装：SATCO')
        print('上线：2013')
        
    def f57():
        b = list(a)
        if y % 4 == 0:
            d = y // 4 + 6
        else:
            d = y // 4 + 7
        print('车号：060' + str(d) + '，代号：06C04花木兰三世，线路：06')
        if d == 57:
            print('特殊性：首列交付且上线')
        elif d == 69:
            print('特殊性：SiC混合牵引（SiC：碳化硅）')
        print('组装：SATCO')
        if d== 57:
            print('上线：2019')
        elif d < 70:
            print('上线：2020')
    def g01():
        b = list(a)
        if y % 6 == 0:
            d = y // 6
        else:
            d = y // 6 + 1
        if d == 0:
            d = 1
        if d < 10:
            print('车号：070' + str(d) + '，代号：07A01芬达，线路：07')
        elif d > 9:
            print('车号：07' + str(d) + '，代号：07A01芬达，线路：07')
        if d == 11:
            print('特殊性：2008年调试时车头贴有世博标志，首列交付')
        elif d == 12:
            print('特殊性：2008年调试时车头贴有世博标志')
        elif d == 34:
            print('特殊性：曾为备件车')
        elif d == 35:
            print('特殊性：拥有上海地铁第2000节车厢')
        if d < 31:
            print('上线：2009')
        else:
            print('上线：2010')
            
    def g43():
        b = list(a)
        if y % 6 == 0:
            d = y // 6
        else:
            d = y // 6 + 1
        print('车号：07' + str(d) + '，代号：07A02邦迪，线路：07')
        if d == 43:
            print('特殊性：第一列交付且上线')
        elif d == 71:
            print('特殊性：最后一列上线')
        if d == 43:
            print('上线：2017')
        elif d < 59:
            print('上线：2018')
        else:
            print('上线：2019')
            
    def g73():
        b = list(a)
        if y % 6 == 0:
            d = y // 6
        else:
            d = y // 6 + 1
        print('车号：070' + str(d) + '，代号：07A03邦迪二世，线路：07')
        if d == 73:
            print('上线：2020')
    def h01():
        b = list(a)
        if y % 6 == 0:
            d = y // 6
        else:
            d = y // 6 + 1
        if d < 10:
            if d == 0:
                d = 1
            print('车号：080' + str(d) + '，代号：08C01蓝精灵，线路：08')
        elif d > 9:
            print('车号：08' + str(d) + '，代号：08C01蓝精灵，线路：08')
        if d == 1:
            print('特殊性：西班牙进口列车；拖车车厢有无障碍设施')
        elif d == 2:
            print('特殊性：首列交付；拖车车厢有无障碍设施')
        elif a == 3:
            print('特殊性：此车厢有圆环扶手')
        elif d == 27:
            print('特殊性：曾为备件车')
        elif d == 28:
            print('特殊性：最后一列上线')
        if d == 28:
            print('上线：2009')
        elif d > 20:
            print('上线：2008')
        else:
            print('上线：2007')
    def h29():
        b = list(a)
        if y % 7 == 0:
            d = y // 7 + 4
        else:
            d = y // 7 + 5
        print('车号：08' + str(d) + '，代号：08C02纸泥鳅，线路：08')
        if d == 29:
            print('特殊性：第一列交付且上线')
        if d < 32:
            print('组装：长客')
        elif d < 35:
            print('组装：SATCO')
        elif d < 38:
            print('组装：长客')
        elif d < 41:
            print('组装：SATCO')
        elif d < 44:
            print('组装：长客')
        else:
            print('组装：SATCO')
        if d == 29 or d == 30 or d == 32:
            print('上线：2009')
        else:
            print('上线：2010')
    def h47():
        b = list(a)
        if y % 7 == 0:
            d = y // 7 + 4
        else:
            d = y // 7 + 5
        print('车号：08' + str(d) + '，代号：08C03电泥鳅，线路：08')
        if d == 47:
            print('特殊性：第一列交付')
        elif d == 52:
            print('特殊性：第一列上线')
        elif d == 53:
            print('特殊性：上阿试车撞墙事故车、最后一列上线')
        print('组装：SATCO')
        if d == 53 or d == 66:
            print('上线：2014')
        elif d < 60:
            print('上线：2012')
        else:
            print('上线：2013')
    def h67():
        b = list(a)
        if y % 7 == 0:
            d = y // 7 + 4
        else:
            d = y // 7 + 5
        print('车号：080' + str(d) + '，代号：08C04泥鳅三世，线路：08')
        if d == 67:
            print('特殊性：第一列交付')
        elif d == 72:
            print('特殊性：第一列上线')
        elif d == 88:
            print('特殊性：SiC/Si混合牵引（Si:硅,SiC:碳化硅）')
        print('组装：SATCO')
        if d == 69 or d == 74:
            print('上线：2020')
        elif d < 77:
            print('上线：2019')
        else:
            print('上线：2020')
        
    def i01():
        b = list
        if y % 6 == 0:
            d = y // 6
        else:
            d = y // 6 + 1
        if d == 0:
            d = 1
        if d < 10:
            print('车号：090' + str(d) + '，代号：09A01蚕宝宝，线路：09')
        elif d > 9:
            print('车号：09' + str(d) + '，代号：09A01蚕宝宝，线路：09')
        print('此车型曾经在1号线，编号0130—0139，特殊性不再显示')
        if d == 5:
            print('特殊性：曾为备件车')
        print('上线：2007')
    def i11():
        b = list(a)
        if y % 6 == 0:
            d = y // 6
        else:
            d = y // 6 + 1
        print('车号：09' + str(d) + '，代号：09A02坂田（冰露），线路：09')
        print('0942—0945,0948曾借给13号线，特殊性不再显示')
        if d == 11:
            print('特殊性：第一次大修后改为白色头灯')
        elif d == 12:
            print('特殊性：第一列交付及上线')
        elif d == 24:
            print('特殊性：曾为备件车')
        if d == 11:
            print('上线：2009')
        elif d < 17:
            print('上线：2008')
        elif d > 41 and d < 46:
            print('上线：2011')
        elif d == 48:
            print('上线：2011')
        else:
            print('上线：2009')
        
    def i52():
        b = list(a)
        if y % 6 == 0:
            d = y // 6
        else:
            d = y // 6 + 1
        print('车号：09' + str(d) + '，代号：电气男孩，特殊性：国产首列A型车、实训专用车，该车型已下线至上海轨道交通实训基地作实训车辆，本线无现役。线路：本线无现役，目前状况未知')
        print('上线：2009')
        
    def i53():
        b = list(a)
        if y % 6 == 0:
            d = y // 6
        else:
            d = y // 6 + 1
        print('车号：09' + str(d) + '，代号：09A03创可贴，线路：09')
        if d == 53:
            print('特殊性：第一列上线')
        elif d == 54:
            print('特殊性：拥有上海地铁第4000节车厢，首列交付')
        elif d == 85:
            print('特殊性：最后一列上线')
        if d < 75:
            print('上线：2017')
        else:
            print('上线：2018')
    def i89():
        b = list(a)
        if y % 6 == 0:
            d = y // 6
        else:
            d = y // 6 + 1
        if d < 100:
            print('车号：090' + str(d) + '，代号：09A04创可贴二世，线路：09')
        elif d > 99:
            print('车号：09' + str(d) + '，代号：09A04创可贴二世，线路：09')
        if d == 90:
            print('特殊性：首列交付')
        elif d == 91:
            print('特殊性：首列上线')
        print('上线：2020')
    def j01():
        b = list(a)
        if y % 6 == 0:
            d = y // 6
        else:
            d = y // 6 + 1
        if d < 10:
            if d == 0:
                d = 1
            print('车号：100' + str(d) + '，代号：10A01热带鱼，线路：10')
        elif d > 9:
            print('车号：10' + str(d) + '，代号：10A01热带鱼，线路：10')
        if d == 4:
            print('特殊性：首列交付')
        elif d == 5:
            print('特殊性：事故车，含修复车厢')
        elif d == 16:
            print('特殊性：事故车，含修复车厢')
        elif d == 21:
            print('特殊性：曾为备件车，最后一列上线')
        elif d == 23:
            print('特殊性：首列拆除驾驶室的10A01')
        if d % 2 == 1:
            print('组装：浦镇')
        elif d % 2 == 0:
            print('组装：SATCO')
        if d == 21:
            print('上线：2015')
        elif d == 39:
            print('上线：2014')
        elif d == 41:
            print('上线：2013')
        elif d == 40:
            print('上线：2011')
        elif d < 38 and d > 30 and d % 2 == 1:
            print('上线：2011')
        else:
            print('上线：2010')
            
    def j42():
        b = list(a)
        if y % 6 == 0:
            d = y // 6
        else:
            d = y // 6 + 1
        print('车号：100' + str(d) + '，代号：10A02热带鱼二世，线路：10')
        if d == 43:
            print('特殊性：第一列上线')
        elif d == 44:
            print('特殊性：第一列交付')
        elif d==47:
            print('特殊性：首列拆除驾驶室的10A02')
        elif d==52:
            print('特殊性：最后一列上线')
        elif d==66:
            print('特殊性：最后一列交付')
        if d % 2 == 1 and d < 68:
            print('组装：浦镇')
        elif d % 2 == 0 and d < 67:
            print('组装：SATCO')
        if d == 42 or d == 44 or d == 51 or d == 55 or d == 59 or d == 61 or d == 63 or d == 65 or d == 67:
            print('上线：2020')
        elif d == 43 or d == 45 or d == 47 or d == 49 or d == 53:
            print('上线：2019')
        else:
            print('上线：2021')
            
    def k01():
        b = list(a)
        if y % 6 == 0:
            d = y // 6
        else:
            d = y // 6 + 1
        if d < 10:
            if d == 0:
                d = 1
            print('车号：110' + str(d) + '，代号：11A01奶咖，线路：11')
        elif d > 9:
            print('车号：11' + str(d) + '，代号：11A01奶咖，线路：11')
        if d == 2:
            print('特殊性：首列交付')
        elif d == 33:
            print('特殊性：曾为备件车')
        elif d == 55:
            print('特殊性：曾为备件车')
        elif d == 66:
            print('特殊性：最后一列上线')
        if d < 17:
            print('上线：2009')
        elif d < 30:
            print('上线：2010')
        elif d == 30 or d == 31 or d == 32 or d == 34:
            print('上线：2011')
        elif d > 34 and d < 42:
            print('上线：2012')
        elif d == 33 or d == 48:
            print('上线：2012')
        elif d > 58:
            print('上线：2015')
        elif d > 50:
            print('上线：2014')
        else:
            print('上线：2013')
    def k67():
        b = list(a)
        if y % 6 == 0:
            d = y // 6
        else:
            d = y // 6 + 1
        
        print('车号：11' + str(d) + '，代号：11A02伪咖，线路：11')
        if d == 67:
            print('特殊性：第一列交付')
        elif d == 68:
            print('特殊性：最后一列上线')
        elif d == 69:
            print('特殊性：第一列上线')
        print('上线：2016')
    def k73():
        b = list(a)
        if y % 6 == 0:
            d = y // 6
        else:
            d = y // 6 + 1
        print('车号：11' + str(d) + '，代号：11A03奶咖二世，线路：11')
        if d == 76:
            print('特殊性：最后一列上线')
        elif d == 77:
            print('特殊性：第一列上线')
        elif d == 80:
            print('特殊性：第一列交付')
        print('上线：2016')
        
    def l01():
        b = list(a)
        if y % 6 == 0:
            d = y // 6
        else:
            d = y // 6 + 1
        if d < 10:
            if d == 0:
                d = 1
            print('车号：120' + str(d) + '，代号：12A01雪碧，线路：12')
        elif d > 9:
            print('车号：12' + str(d) + '，代号：12A01雪碧，线路：12')
        if d == 2:
            print('特殊性：首列交付')
        elif d == 29:
            print('特殊性：最后一列上线')
        if d == 29:
            print('上线：2016')
        elif d < 21:
            print('上线：2013')
        elif d < 27:
            print('上线：2014')
        else:
            print('上线：2015')
    def l42():
        b = list(a)
        if y % 6 == 0:
            d = y // 6
        else:
            d = y // 6 + 1
        print('车号：12' + str(d) + '，代号：12A02雪碧二世，线路：12')
        if d == 43:
            print('特殊性：第一列交付且上线')
        elif d == 56:
            print('特殊性：最后一列上线')
        print('上线：2018')
    def l57():
        b = list(a)
        if y % 6 == 0:
            d = y // 6
        else:
            d = y // 6 + 1
        print('车号：120' + str(d) + '，代号：12A03雪碧三世，线路：12')
        if d == 57:
            
            print('特殊性：第一列交付且上线')
        print('上线：2020')
    def m01():
        b = list(a)
        if y % 6 == 0:
            d = y // 6
        else:
            d = y // 6 + 1
        if d < 10:
            if d == 0:
                d = 1
            print('车号：130' + str(d) + '，代号：13A01奶粉，线路：13')
        elif d > 9:
            print('车号：13' + str(d) + '，代号：13A01奶粉，线路：13')
        if d == 1:
            print('特殊性：拥有上海地铁第3000节车厢，首列交付')
        elif d == 24:
            print('特殊性：车内灯光为冷色光，最后一列上线')
        if d == 23 or d == 24:
            print('上线：2014')
        elif d > 10:
            print('上线：2013')
        else:
            print('上线：2012')
    def m25():
        b = list(a)
        if y % 6 == 0:
            d = y // 6
        else:
            d = y // 6 + 1
        print('车号：13' + str(d) + '，代号：13A02奶粉二世，线路：13')
        if d == 26:
            print('特殊性：首列交付')
        elif d == 27:
            print('特殊性：首列上线')
        elif d == 54:
            print('特殊性：最后一列上线')
        elif d == 58 or d == 59 or d == 60:
            print('特殊性：显示屏特殊')
        elif d == 61:
            print('特殊性：显示屏特殊（独苗）')
        elif d == 62:
            print('特殊性：显示屏特殊（独苗且LCD类似成都地铁）')
        if d == 54 or d == 91 or d == 62 or d == 44:
            print('上线：2019')
        elif d > 38:
            print('上线：2018')
        else:
            print('上线：2017')
    def p01():
        b = list(a)
        if y % 3 == 0:
            d = y // 3
        else:
            d = y // 3 + 1
        if d < 10:
            if d == 0:
                d = 1
            if a == '160041':
                d = 2
            if a == '160071':
                d = 3
            print('车号：160' + str(d) + '，代号：16A01抹茶，线路：16')
        elif d > 10:
            print('车号：16' + str(d) + '，代号：16A01抹茶，线路：16')
        if d == 2:
            print('特殊性：曾因重连测试致车钩断裂')
        elif d == 3:
            print('特殊性：首列交付')
        if d > 35:
            print('上线：2015')
        elif d > 24:
            print('上线：2014')
        else:
            print('上线：2013')
    def p47():
        b = list(a)
        if y % 6 == 0:
            d = y // 6
        else:
            d = y // 6 + 1
        d += 23
        
        print('车号：160' + str(d) + '，代号：16A02抹茶二世，线路：16')
        if d == 47:
            print('特殊性：首列交付')
        elif d == 48:
            print('特殊性：首列上线')
        
        print('上线：2020')
    def q01():
        b = list(a)
        if y % 6 == 0:
            d = y // 6
        else:
            d = y // 6 + 1
        if d < 10:
            if d == 0:
                d = 1
            print('车号：170' + str(d) + '，代号：17A01西柚，线路：17')
        elif d > 9:
            print('车号：17' + str(d) + '，代号：17A01西柚，线路：17')
        
        if d == 1:
            print('特殊性：首列交付')
            if a == '170044' or a == '170043':
                print('此车厢车厢车体号印刷错误，印刷车体号为170044，实际车体号为170043')
        
        elif d == 6:
            print('特殊性：车号与车体号为细字体')
        elif d == 28:
            print('特殊性：最后一列交付且上线')
        if d < 6:
            print('组装：长客')
        elif d > 5:
            print('组装：SATCO')
        if d == 28:
            print('上线：2020')
        elif d == 21 or d == 22:
            print('上线：2018')
        elif d < 28 and d > 22:
            print('上线：2019')
        else:
            print('上线：2017')
    def PJX():
        b = list(a)
        if w % 4 == 0:
            d = w // 4
        else:
            d = w // 4 + 1
        if d < 10:
            if d == 0:
                d = 1
            print('车号：T010' + str(d) + '，代号：小灰灰/草鱼，线路：浦江线')
        elif d > 9:
            print('车号：T01' + str(d) + '，代号：小灰灰/草鱼，线路：浦江线')
        if d == 1:
            print('特殊性：首列交付')
        print('上线：2018')
    def n01():
        b = list(a)
        if y % 8 == 0:
            d = y // 8
        else:
            d = y // 8 + 1
        if d < 10:
            if d == 0:
                d = 1
            print('车号：1400' + str(d) + '，代号：14A01高达，线路：14')
        elif d > 9:
            print('车号：140' + str(d) + '，代号：14A01高达，线路：14')
        if d == 2:
            print('特殊性：首列交付')
            print('上线：2022')
        elif d==1:
            print('特殊性：最后一列交付')
            print('上线：2022')
        elif d==33:
            print('特殊性：“上海地铁第7000节”仪式用车')
            print('上线：2021')
        elif d==3:
            print('上线：2022')
        elif d>3 and d<50:
            print('上线：2021')
        print('组装：中车浦镇')
    def o01():
        b = list(a)
        if y % 6 == 0:
            d = y // 6
        else:
            d = y // 6 + 1
        if d < 10:
            if d == 0:
                d = 1
            print('车号：1500' + str(d) + '，代号：15A01长鼻猴/奶茶，线路：15')
        elif d > 9:
            print('车号：150' + str(d) + '，代号：15A01长鼻猴/奶茶，线路：15')
        if d == 3:
            print('特殊性：首列交付')
        elif d==30:
            print('特殊性：“上海地铁第7000节”仪式用车')
        print('组装：SATCO')
        if d < 32:
            print('上线：2021')
        elif d<55:
            print('上线：2022')
    def r01():
        b = list(a)
        if y % 6 == 0:
            d = y // 6
        else:
            d = y // 6 + 1
        if d < 10:
            if d == 0:
                d = 1
            print('车号：1800' + str(d) + '，代号：18A01闪电侠，线路：18')
        elif d > 9:
            print('车号：180' + str(d) + '，代号：18A01闪电侠，线路：18')
        if d == 3:
            print('特殊性：首列交付')
        elif d==45:
            print('特殊性：“上海地铁第7000节”仪式用车')
        elif d==50:
            print('特殊性：最后一列交付且上线')
        print('组装：中车株机')
        if d > 2 and d < 8:
            print('上线：2020')
        elif d > 8 and d < 21:
            print('上线：2020')
        elif d==50:
            print('上线：2022')
        else:
            print('上线：2021')
    def JY():
        b = list(a)
        if v % 4 == 0:
            d = v // 4
        else:
            d = v // 4 + 1
        
        if d == 0:
            d = 1
        print('车号：JY010' + str(d) + '，代号：浦东机场捷运线（昵称未定，预计为大白），线路：浦东机场捷运线')
        if d == 1:
            print('特殊性：首列交付')
        print('上线：2019')
    def SJYGDC01():
        b = list(a)
        if v % 5 == 0:
            d = v // 5
        else:
            d = v // 5 + 1
        if d == 0:
            d = 1
        print('车号：SJ010' + str(d) + '，代号：蚕宝宝（松江有轨电车），线路：松江有轨电车')
        if d == 1:
            print('特殊性：首列交付')
    def SJYGDC05():
        b = list(a)
        if v % 5 == 0:
            d = v // 5+ 1
        else:
            d = v // 5 + 2
        if d < 10:
            print('车号：SJ010' + str(d) + '，代号：蚕宝宝（松江有轨电车），线路：松江有轨电车')
        elif d > 9:
            print('车号：SJ01' + str(d) + '，代号：蚕宝宝（松江有轨电车），线路：松江有轨电车')
    def SJYGDC15():
        b = list(a)
        if v % 5 == 0:
            d = v // 5+ 2
        else:
            d = v // 5 + 3
        print('车号：SJ01' + str(d) + '，代号：蚕宝宝（松江有轨电车），线路：松江有轨电车')
    def SJYGDC25():
        b = list(a)
        if v % 5 == 0:
            d = v // 5+ 3
        else:
            d = v // 5 + 4
        print('车号：SJ01' + str(d) + '，代号：蚕宝宝（松江有轨电车），线路：松江有轨电车')
    def SJYGDC35():
        b = list(a)
        if v % 5 == 0:
            d = v // 5+ 4
        else:
            d = v // 5 + 5
        print('车号：SJ01' + str(d) + '，代号：蚕宝宝（松江有轨电车），线路：松江有轨电车')
    if m == '1':
        print('请问您需要什么帮助？请输入以下问题获取帮助')
        print('程序无法运行')
        print('想要源代码')
        print('车体号计算错误')
        print('程序报错')
        print('程序闪退')
        print()
        helper = input()
        print()
        if helper == '程序无法运行':
            print('请检查你的软件是否为最新版本，如果是，请重新安装软件。')
        elif helper == '想要源代码':
            print('请联系邮箱rain02095@qq.com')
        elif helper == '车体号计算错误':
            print('检查一下是不是您的车体号输入错误了呢，如果没有请联系制作人进行修改，联系时请注意描述清楚哪里出错了哦~')
        elif helper == '程序报错':
            print('检查一下您的车体号是不是输入不规范或者您的软件不是最新版本呢，如果没有请联系制作人进行修改，联系时请注意描述清楚哪里报错的内容哦~')
        elif helper == '程序闪退':
            print('检查一下程序闪退前1秒钟是不是显示了一堆乱码呢，如果是的话在输入helper后再输入程序报错，即可得到答案哦~')       
        else:
            print('没有找到帮助')
    elif m == '7':
        print()
        print('新增功能：简化功能使用，新增非数字线路车号查询，可设置出结果后停留时间。')
        print()
    elif m == '4':
        print()
        print('步骤：1.右键单击软件快捷方式（直接单击软件没有效果）；2.左键单击属性；3.点击颜色；4.自行设置rgb数值即可')
    elif m == '5':
        print('您可以设置的有：')
        print('1. 是否显示最后的咨询语句')
        print('2. 是否需要关闭软件')
        print('3. 设置计算出结果后等待时间')
        print('1:是:请复制代码：a = T 否：复制代码：a = F 2：是: b = T 否：b = F 3：直接输入数字即可（上限3 下限1，默认1.5，仅限整数，退出后不保存）')
        answer_shezhi = input()
        if answer_shezhi == 'a = T':
            print('设置成功')
        elif answer_shezhi == 'a = F':
            print('设置成功')
        elif answer_shezhi == 'b = T':
            break
        elif answer_shezhi == 'b = F':
            continue
        try:
            if int(answer_shezhi) >= 1 and int(answer_shezhi) <= 3:
                time_set = int(answer_shezhi)
            else:
                print('设置失败')
        except:
            print('设置失败')
    elif m == '6':
        print('上海地铁查询器电脑版用户协议')
        print('一、版权问题')
        print('1.本软件一切权利归原作者@Rain&Thomas以及提供技术支持的lolo_often所有，软件查询输出结果归上海地铁车体号表原作者@alstomfish&wxy所有。')
        print('2.本软件制作方从2020.5一直制作到2021.5，如果有人对本软件版权问题作出极端行为，将暂停开放使用一周。')
        print('二、权利及义务的分配')
        print('1.制作者不对软件查询的准确性负责，查询输出内容并非申通地铁集团的官方意见。')
        print('2.使用者可以向制作人对软件提出建议，5天内无人回复即为无效回复。')
        print('3.本软件没有向制作人索要任何个人信息，如果隐私泄露，与制作方无关。')
        print('4.如软件运行故障，请向制作人报告，谢谢。目前已知问题有：部分分辨率和类型的电脑全屏只能出半屏，制作人不对此问题负责。')
        print('5.使用时请关闭所有的杀毒软件，否则误报导致的后果制作人不负责。')
        print('6.制作人有权利对软件做出任何更改。')
        print('7.请在软件使用时连接互联网，否则出现的问题制作人不负责。')
        print('8.使用者有权利对本协议提出疑问，并要求软件制作人提出更改要求。')
        print('9.使用者有权利查看软件源代码，需要请联系rain02095@qq.com。')
        print('10.使用者有权利申请加入本软件开发者，但要求有邮箱并不拒收其他开发者发的邮件，无报酬，全自愿。')
        print('11.使用者和开发者享有以上权利并要履行上述义务')
        print('12.本软件可能会在不知情的情况下下载任何文件，由此导致的内存不足以及其它问题制作方不负责。')
        print('三、隐私协议')
        print('1.见“二、权利及义务的分配”第3条')
        print('2.如软件故障导致的隐私泄露可以向制作人申请赔偿（可以提前获取新版本，不接受任何有关财产和钱财的赔偿要求）。')
        print('3.本软件免费提供给地铁爱好者使用，没有收费，请不要相信任何付费的地铁查询器。')
        print('用户协议显示到此完毕')
    elif m == '8':
        break
    elif m == '3':
        h = str(input('请输入五位数车号,无计算结果即输入错误'))
        if len(h) == 5:
            try:
                if int(h[2]+h[3]+h[4])>0:
                    if int(h[0]+h[1]) == 7:
                        if int(h[2]+h[3]+h[4]) < 43:
                            print('车型：07A01芬达')
                            print('组装：长客庞巴迪')
                            if h[3]+h[4] == '11':
                                print('特殊性：2008年调试时车头贴有世博标志，首列交付')
                            elif h[3]+h[4] == '12':
                                print('特殊性：2008年调试时车头贴有世博标志')
                            elif h[3]+h[4] == '34':
                                print('特殊性：曾为备件车')
                            elif h[3]+h[4] == '35':
                                print('特殊性：“上海地铁第2000节”仪式用车')
                            if int(h[3]+h[4]) < 31:
                                print('上线：2009')
                            else:
                                print('上线：2010')
                        elif int(h[2]+h[3]+h[4]) < 73:
                            print('车型：07A02邦迪')
                            print('组装：中车长客')
                            if h[3]+h[4] == '43':
                                print('特殊性：首列交付且上线')
                                print('上线：2017')
                            elif h[3]+h[4] == '71':
                                print('特殊性：最后一列上线')
                            if int(h[3]+h[4]) > 43 and int(h[3]+h[4]) < 54:
                                print('上线：2018')
                            elif h[3]+h[4] == '58':
                                print('上线：2018')
                            else:
                                print('上线：2019')
                            
                        elif int(h[2]+h[3]+h[4]) < 80 :
                            print('车型：07A03邦迪二世')
                            print('组装：中车长客')
                            if h[3]+h[4] == '73':
                                print('特殊性：首列交付且上线')
                            elif h[3]+h[4] == '74':
                                print('特殊性：最后一列上线')
                            print('上线：2020')
                      
                    
                    elif int(h[0]+h[1]) == 11:
                        if int(h[2]+h[3]+h[4]) < 67:
                            print('车型：11A01奶咖')
                            print('组装：南车株机')
                            if int(h[3]+h[4]) < 17:
                                print('上线：2009')
                            elif int(h[3]+h[4]) < 30:
                                print('上线：2010')
                            elif int(h[3]+h[4]) == 30 or int(h[3]+h[4]) == 31 or int(h[3]+h[4]) == 32 or int(h[3]+h[4]) == 34:
                                print('上线：2011')
                            elif int(h[3]+h[4]) > 34 and int(h[3]+h[4]) < 42:
                                print('上线：2012')
                            elif int(h[3]+h[4]) == 33 or int(h[3]+h[4]) == 48:
                                print('上线：2012')
                            elif int(h[3]+h[4]) > 58:
                                print('上线：2015')
                            elif int(h[3]+h[4]) > 50:
                                print('上线：2014')
                            else:
                                print('上线：2013')
                            if h[3]+h[4] == '02':
                                print('特殊性：首列交付')
                            elif h[3]+h[4] == '33':
                                print('特殊性：曾为备件车')
                            elif h[3]+h[4] == '55':
                                print('特殊性：曾为备件车')
                            elif h[3]+h[4] == '66':
                                print('特殊性：最后一列上线')
                        elif int(h[2]+h[3]+h[4]) < 73:
                            print('车型：11A02伪咖')
                            print('组装：SATCO')
                            print('上线：2016')
                            if int(h[3]+h[4]) == 67:
                                print('特殊性：第一列交付')
                            elif int(h[3]+h[4]) == 68:
                                print('特殊性：最后一列上线')
                            elif int(h[3]+h[4]) == 69:
                                print('特殊性：第一列上线')
                        elif int(h[2]+h[3]+h[4]) < 83:
                            print('车型：11A03奶咖二世')
                            print('组装：中车株机')
                            print('上线：2016')
                            if int(h[3]+h[4]) == 80:
                                print('特殊性：第一列交付')
                            elif int(h[3]+h[4]) == 76:
                                print('特殊性：最后一列上线')
                            elif int(h[3]+h[4]) == 77:
                                print('特殊性：第一列上线')                            
                                
                    elif int(h[0]+h[1]) == 12:
                        if int(h[2]+h[3]+h[4]) < 42:
                            print('车型：12A01雪碧')
                            print('组装：长客庞巴迪')
                            if h == '12002':
                                print('特殊性：首列交付')
                            if int(h[3]+h[4]) < 17:
                                print('上线：2013') 
                            elif int(h[3]+h[4]) > 17 and (h[3]+h[4]) < 21:
                                print('上线：2013') 
                            elif h == '12017':
                                print('上线：2014')
                            elif int(h[3]+h[4]) > 20 and (h[3]+h[4]) < 27:
                                print('上线：2014')
                            elif h =='12029':
                                print('特殊性：最后一列上线')
                                print('上线2016')
                            else:
                                print('上线2015')
                        elif int(h[2]+h[3]+h[4]) > 41 and int(h[2]+h[3]+h[4]) < 57:
                            print('车型：12A02雪碧二世')
                            print('组装：中车长客')
                            if h == '12043':
                                print('特殊性：首列交付且上线')
                            if h == '12056':
                                print('特殊性：最后一列上线')
                            print('上线：2018')
                        elif int(h[2]+h[3]+h[4]) > 56 and int(h[2]+h[3]+h[4]) < 76:
                            print('车型：12A02雪碧二世')
                            print('组装：中车长客')
                            if h == '12057':
                                print('特殊性：首列交付且上线')
                            if h == '12075':
                                print('特殊性：最后一列上线')
                            if int(h[3]+h[4]) < 74:
                                print('上线：2020') 
                            else:
                                print('上线：2021')
                        
                            
                    elif int(h[0]+h[1]) == 13:
                        if int(h[2]+h[3]+h[4]) < 25:
                            print('车型：13A01奶粉')
                            print('组装：中国中车')
                            if int(h[3]+h[4]) > 00 and int(h[3]+h[4]) < 8:
                                if h == '13001':
                                    print('特殊性：上海地铁第3000节仪式用车，首列交付')
                                    print('上线：2012')    
                                if int(h[3]+h[4]) > 7 and int(h[4]) < 23: 
                                    print('上线：2013')  
                                elif int(h[3]+h[4]) == 23 or int(h[3]+h[4]) == 24:
                                    if h == '13024':
                                        print('特殊性：车内灯光为冷色光，最后一列上线')
                                        print('上线：2014')
                                    else:
                                        print('上线：2013')
                                    
                        elif int(h[2]+h[3]+h[4]) > 24:
                            print('车型：13A02奶粉二世')
                            print('组装：中国中车')
                            if int(h[3]+h[4]) > 24 and int(h[3]+h[4]) < 39:
                                if h == '13026':
                                    print('特殊性：首列交付')
                                if h == '13027':
                                    print('特殊性：首列上线')
                                    print('上线：2017')
                                elif int(h[3]+h[4]) > 38 and int(h[3]+h[4]) < 44:
                                    print('上线：2018')
                                elif int(h[3]+h[4]) > 44 and int(h[3]+h[4]) < 53:
                                    print('上线：2018')
                                elif int(h[3]+h[4]) > 54 and int(h[3]+h[4]) < 61:
                                    if h == '13058' or h == '13059' or h == '13060':
                                        print('特殊性：显示屏特殊')
                                    print('上线：2018')
                                elif int(h[3]+h[4]) == 44 or int(h[3]+h[4]) == 54 or int(h[3]+h[4]) == 61 or int(h[3]+h[4]) == 62:
                                    if h =='13054':
                                        print('特殊性：最后一列上线')
                                    elif h == '13061': 
                                        print('特殊性：显示屏特殊（独苗）（现跟1358-1360一样）')
                                    elif h == '13062':
                                        print('特殊性：显示屏特殊（独苗且LCD类似成都地铁）；最后一列交付')
                                    print('上线：2018')
                       
                    
                    elif int(h[0]+h[1]) == 15 and int(h[2]+h[3]+h[4])<55:
                        print('车型：15A01长鼻猴')
                        print('组装：SATCO')
                        if h == '15003':
                            print('特殊性：首列交付')
                        if int(h[3]+h[4]) < 32:
                            print('上线：2021')
                            
                    if int(h[0]+h[1]) == 16:
                        if int(h[2]+h[3]+h[4]) < 47:
                            print('车型：16A01抹茶')
                            print('组装：南车株机')
                            if int(h[3]+h[4]) > 00 and int(h[4]) < 10:
                                if  h=='16002':
                                    print('特殊性：曾因重连测试致车钩断裂')
                                elif h == '16003':
                                    print('特殊性：首列交付')
                                print('上线：2013')
                            elif int(h[3]+h[4]) > 9 and int(h[3]+h[4]) < 16:
                                print('上线：2013')
                            elif int(h[3]+h[4]) == 17:
                                print('上线：2013')
                            elif int(h[3]+h[4]) == 16:
                                print('上线：2014')
                            elif int(h[3]+h[4]) > 17 and int(h[3]+h[4]) < 29:
                                print('上线：2014')
                            elif int(h[3]+h[4]) == 30:
                                print('上线：2014')
                            elif int(h[3]+h[4]) == 29:
                                print('上线：2015')
                            elif int(h[3]+h[4]) > 30 and int(h[3]+h[4]) < 44:
                                print('上线：2015')
                            elif int(h[3]+h[4]) == 44:
                                print('上线：2016')
                            elif int(h[3]+h[4]) == 45 or int(h[3]+h[4]) == 46:
                                print('上线：2015')
                        elif int(h[2]+h[3]+h[4]) > 46 and int(h[2]+h[3]+h[4]) < 62:
                            print('车型：16A02抹茶二世')
                            print('组装：中车株机')
                            if  h=='16047':
                                print('特殊性：首列交付')
                            elif h == '16048':
                                print('特殊性：首列上线')
                            elif h == '16052':
                                print('特殊性：上海地铁第6000节”仪式用车')
                            elif h == '16059':
                                print('特殊性：最后一列交付')
                            elif h == '16061':
                                print('特殊性：最后一列上线')
                            print('上线：2020')
                        
                            
                            
                    if int(h[0]+h[1]) == 17:
                        print('车型：17A01西柚')
                        if h == '17001':
                            print('特殊性：首列交付')
                        
                        elif h == '17006':
                            print('特殊性：车号与车体号为细字体')
                        elif h == '17028':
                            print('特殊性：最后一列交付且上线')
                        if int(h[3]+h[4]) < 6:
                            print('组装：长客')
                        elif int(h[3]+h[4]) > 5:
                            print('组装：SATCO')
                        if int(h[3]+h[4]) == 28:
                            print('上线：2020')
                        elif int(h[3]+h[4]) == 21 or int(h[3]+h[4]) == 22:
                            print('上线：2018')
                        elif int(h[3]+h[4]) < 28 and int(h[3]+h[4]) > 22:
                            print('上线：2019')
                        else:
                            print('上线：2017')
                        
                        
                    if int(h[0]+h[1]) == 18:
                        print('车型：18A01闪电侠')
                        if h == '18003':
                            print('特殊性：首列交付')
                        print('组装：中车株机')
                        if int(h[3]+h[4]) > 2 and int(h[3]+h[4]) < 8:
                            print('上线：2020')
                        elif int(h[3]+h[4]) > 8 and int(h[3]+h[4]) < 21:
                            print('上线：2020')
                        else:
                            print('上线：2021')
                    if int(h[0]+h[1]) == 10:
                        if int(h[2]+h[3]+h[4]) < 42:
                            print('车型：10A01热带鱼')
                            if int(h[3]+h[4]) % 2 == 1:
                                print('组装：浦镇')
                            elif int(h[3]+h[4]) % 2 == 0:
                                print('组装：SATCO')
                            if h == '10004':
                                print('特殊性：首列交付')
                            elif h == '10005':
                                print('特殊性：“927”事故车、含修复车厢')
                            elif h == '10016':
                                print('特殊性：“927”事故车、含修复车厢')
                            elif h == '10021':
                                print('特殊性：曾经备件车，最后一列上线')
                            elif h == '10023':
                                print('特殊性：首列拆驾驶室并实现真正无人驾驶')
                            if int(h[3]+h[4]) == 21:
                                print('上线：2015')
                            elif int(h[3]+h[4]) == 39:
                                print('上线：2014')
                            elif int(h[3]+h[4]) == 41:
                                print('上线：2013')
                            elif int(h[3]+h[4]) == 40:
                                print('上线：2011')
                            elif int(h[3]+h[4]) < 38 and int(h[3]+h[4]) > 30 and int(h[3]+h[4]) % 2 == 1:
                                print('上线：2011')
                            else:
                                print('上线：2010')
                        if int(h[2]+h[3]+h[4]) > 41 and int(h[2]+h[3]+h[4]) < 68:
                            print('车型：10A02热带鱼二世')
                            if int(h[3]+h[4]) % 2 == 1:
                                print('组装：浦镇')
                            elif int(h[3]+h[4]) % 2 == 0:
                                print('组装：SATCO')
                            if h == '10043':
                                print('特殊性：首列上线')
                            elif h == '10045':
                                print('特殊性：首列交付')
                            if h == '10042' or h == '10044' or h == '10051' or h == '10055' or h == '10059' or h == '10061' or h == '10063' or h == '10065' or h == '10067':
                                print('上线：2020')
                            elif h == '10043' or h == '10045' or h == '10047' or h == '10049' or h == '10053':
                                print('上线：2019')
                            else:
                                print('上线：2021')
                    if int(h[0]+h[1]) == 9:
                        if int(h[2]+h[3]+h[4]) > 0 and int(h[2]+h[3]+h[4]) < 11:
                            print('车型：09A01蚕宝宝')
                            print('上线：2007')
                            print('曾经在1号线')
                            if h == '09005':
                                print('特殊性：曾为备件车')
                        elif int(h[2]+h[3]+h[4]) > 10 and int(h[2]+h[3]+h[4]) < 52:
                            print('车型：09A02坂田')
                            if int(h[3]+h[4]) > 11 and int(h[3]+h[4]) < 17:
                                print('上线：2008')
                            elif int(h[3]+h[4]) == 40 or int(h[3]+h[4]) == 41 or int(h[3]+h[4]) == 46 or int(h[3]+h[4]) == 47 or int(h[3]+h[4]) > 48:
                                print('上线：2010')
                            elif int(h[3]+h[4]) > 41 and int(h[3]+h[4]) < 46:
                                print('上线：2011')
                                print('特殊性：世博期间曾借调给13号线')
                            elif int(h[3]+h[4]) == 48:
                                print('上线：2011')
                                print('特殊性：世博期间曾借调给13号线')
                            else:
                                print('上线：2009')
                            if int(h[3]+h[4]) == 11:
                                print('特殊性：第一次大修后改为白色头灯')
                            elif int(h[3]+h[4]) == 12:
                                print('特殊性：首列交付并上线')
                            elif int(h[3]+h[4]) == 24:
                                print('特殊性：曾为备件车')
                        elif h == '09052':
                            print('车型：09ASY电气男孩')
                            print('上线：2009，本车无现役')
                            print('特殊性：国产首列A型车、实训专用车，SATCO组装')
                        elif int(h[2]+h[3]+h[4]) > 52 and int(h[2]+h[3]+h[4]) < 89:
                            print('车型：09A03创可贴')
                            if int(h[3]+h[4]) < 75:
                                print('上线：2017')
                            else:
                                print('上线：2018')
                            if int(h[3]+h[4]) == 53:
                                print('特殊性：首列上线')
                            elif int(h[3]+h[4]) == 54:
                                print('特殊性：“上海地铁第5000节”仪式用车，首列交付')
                            elif int(h[3]+h[4]) == 85:
                                print('特殊性：最后一列上线')
                        elif int(h[2]+h[3]+h[4]) > 88 and int(h[2]+h[3]+h[4]) < 106:
                            print('车型：09A04创可贴二世')
                            print('上线：2020')
                            if int(h[3]+h[4]) == 90:
                                print('特殊性：首列交付')
                            elif int(h[3]+h[4]) == 91:
                                print('特殊性：首列上线')
                            elif int(h[2]+h[3]+h[4]) == 100:
                                print('特殊性：最后一列上线')
                    if int(h[0]+h[1]) == 8:
                        if int(h[2]+h[3]+h[4])>0 and int(h[2]+h[3]+h[4])<29:
                            print('车型：08C01蓝精灵')
                            if int(h[3]+h[4])<21:
                                print('上线：2007')
                            else:
                                print('上线：2008')
                            if h == '08001':
                                print('特殊性：西班牙进口列车；拖车车厢有无障碍设施')
                            elif h == '08002':
                                print('特殊性：首列交付；拖车车厢有无障碍设施')
                            elif h == '08003':
                                print('特殊性：绿色底纹车厢有圆环扶手')
                            elif h == '08021':
                                print('特殊性：“上海地铁第1000节”仪式用车（实际不存在）')
                            elif h == '08027':
                                print('特殊性：曾为备件车')
                            elif h == '08028':
                                print('特殊性：最后一列上线')
                        elif int(h[2]+h[3]+h[4])>28 and int(h[2]+h[3]+h[4])<47:
                            print('车型：08C02纸泥鳅（泥鳅）')
                            if int(h[3]+h[4]) < 32:
                                print('组装：长客')
                            elif int(h[3]+h[4]) < 35:
                                print('组装：SATCO')
                            elif int(h[3]+h[4]) < 38:
                                print('组装：长客')
                            elif int(h[3]+h[4]) < 41:
                                print('组装：SATCO')
                            elif int(h[3]+h[4]) < 44:
                                print('组装：长客')
                            else:
                                print('组装：SATCO')
                            if int(h[2]+h[3]+h[4]) == 29 or int(h[2]+h[3]+h[4]) == 32:
                                print('上线：2009')
                            else:
                                print('上线：2010')
                            if int(h[3]+h[4]) == 29:
                                print('特殊性：首列交付且上线')
                            elif int(h[3]+h[4]) == 45:
                                print('特殊性：最后一列上线')
                        elif int(h[2]+h[3]+h[4]) > 46 and int(h[2]+h[3]+h[4]) < 67:
                            print('车型：08C03电泥鳅（泥鳅二世）')
                            print('组装：SATCO')
                            if int(h[3]+h[4]) == 53 or int(h[3]+h[4]) == 66:
                                print('上线：2014')
                            elif int(h[3]+h[4]) == 56 or int(h[3]+h[4]) > 59:
                                print('上线：2013')
                            else:
                                print('上线：2012')
                            if int(h[3]+h[4]) == 47:
                                print('特殊性：首列交付')
                            elif int(h[3]+h[4]) == 52:
                                print('特殊性：首列上线')
                            elif int(h[3]+h[4]) == 53:
                                print('特殊性：SATCO试车撞墙事故车；最后一列上线')
                        elif int(h[2]+h[3]+h[4]) > 66 and int(h[2]+h[3]+h[4]) < 91:
                            print('车型：08C04泥鳅三世')
                            print('组装：SATCO')
                            if int(h[3]+h[4]) == 67 or int(h[3]+h[4]) == 68 or int(h[3]+h[4]) == 70 or int(h[3]+h[4]) == 71 or int(h[3]+h[4]) == 72 or int(h[3]+h[4]) == 73 or int(h[3]+h[4]) == 75:
                                print('上线：2019')
                            elif int(h[3]+h[4]) == 80 or int(h[3]+h[4]) == 81 or int(h[3]+h[4]) == 85 or int(h[3]+h[4]) == 90:
                                print('上线：2021')
                            else:
                                print('上线：2020')
                            if int(h[3]+h[4]) == 67:
                                print('特殊性：首列交付')
                            elif int(h[3]+h[4]) == 72:
                                print('特殊性：首列上线')
                    if int(h[0]+h[1]) == 6:
                        if int(h[2]+h[3]+h[4]) < 24 and int(h[2]+h[3]+h[4]) > 0 and not int(h[4]) == 4:
                            print('车型：06C01Kitty')
                            if int(h[3]+h[4]) < 18:
                                print('上线：2007')
                            else:
                                print('上线：2008')
                            if int(h[3]+h[4]) == 1:
                                print('特殊性：首列交付')
                            elif int(h[3]+h[4]) == 6:
                                print('曾为备件车')
                        elif int(h[2]+h[3]+h[4]) > 24 and int(h[2]+h[3]+h[4]) < 37 and not int(h[4]) == 4:
                            print('车型：06C02纸花木兰（花木兰）')
                            if int(h[3]+h[4]) < 27:
                                print('上线：2009')
                            else:
                                print('上线：2010')
                            if int(h[3]+h[4]) < 28 or int(h[3]+h[4]) == 29 or int(h[3]+h[4]) == 31 or int(h[3]+h[4]) == 33:
                                print('组装：长客')
                            else:
                                print('组装：SATCO')
                            if int(h[3]+h[4]) == 25:
                                print('特殊性：首列交付且上线')
                        elif int(h[2]+h[3]+h[4]) > 36 and int(h[2]+h[3]+h[4]) < 57 and not int(h[4]) == 4:
                            print('车型：06C03电花木兰（花木兰二世）')
                            if int(h[3]+h[4]) < 41:
                                print('上线：2012')
                            else:
                                print('上线：2013')
                            print('组装：SATCO')
                            if int(h[3]+h[4]) == 37:
                                print('特殊性：首列交付并上线')
                        elif int(h[2]+h[3]+h[4]) > 56 and int(h[2]+h[3]+h[4]) <83:
                            print('车型：06C04花木兰三世')
                            if int(h[3]+h[4]) == 57:
                                print('上线：2019')
                                print('特殊性：首列交付并上线')
                            elif int(h[3]+h[4]) == 64 or int(h[3]+h[4]) > 70:
                                print('上线：2021')
                            else:
                                print('上线：2020')
                            print('组装：SATCO')
                    if int(h[0]+h[1]) == 5:
                        if int(h[2]+h[3]+h[4]) > 0 and int(h[2]+h[3]+h[4]) < 19 and not int(h[2]+h[3]+h[4]) == 14:
                            print('车型：05C01番茄炒蛋')
                            if int(h[3]+h[4]) < 8:
                                print('上线：2003')
                            if int(h[3]+h[4]) == 1:
                                print('特殊性：阿尔斯通进口车')
                        elif int(h[2]+h[3]+h[4]) > 18 and int(h[2]+h[3]+h[4]) < 52:
                            print('车型：05C02紫罗兰')
                            if int(h[3]+h[4]) == 25 or int(h[3]+h[4]) == 40 or int(h[3]+h[4]) > 47:
                                print('上线：2019')
                            else:
                                print('上线：2018')
                            if int(h[3]+h[4]) == 19:
                                print('特殊性：首列交付')
                            elif int(h[3]+h[4]) == 25:
                                print('特殊性：平庄公路事故车（含修复车厢），最后一列上线')
                            elif int(h[3]+h[4]) == 51:
                                print('特殊性：最后一列交付')
                    if int(h[0]+h[1]) == 4:
                        if int(h[2]+h[3]+h[4]) > 0 and int(h[2]+h[3]+h[4]) < 29:
                            print('车型：04A01奶嘴')
                            if int(h[3]+h[4]) < 21:
                                print('上线：2005')
                            else:
                                print('上线：2008，曾借调给2号线')
                            if int(h[3]+h[4]) == 1 or int(h[3]+h[4]) == 2:
                                print('进口列车')
                            else:
                                print('组装：株机')
                            if int(h[3]+h[4]) == 5:
                                print('特殊性：曾张江实训专用车')
                            elif int(h[3]+h[4]) == 24:
                                print('特殊性：曾为备件车')
                        elif int(h[2]+h[3]+h[4]) > 28 and int(h[2]+h[3]+h[4]) < 37:
                            print('车型：04A02黑包公')
                            if int(h[3]+h[4]) < 33:
                                print('上线：2015')
                            else:
                                print('上线：2016')
                            if int(h[3]+h[4]) == 29:
                                print('组装：长客')
                                print('特殊性：贴纸在窗户上')
                            else:
                                print('组装：SATCO')
                            if int(h[3]+h[4]) == 30:
                                print('特殊性：首列交付并上线')
                        elif int(h[2]+h[3]+h[4]) > 49 and int(h[2]+h[3]+h[4]) < 56:
                            print('车型：04A02黑包公')
                            if int(h[3]+h[4]) == 50:
                                print('上线：2018')
                            elif int(h[3]+h[4]) == 55:
                                print('上线：2019')
                                print('特殊性：最后一列交付并上线')
                            else:
                                print('上线：2017')
                            print('组装：SATCO')
                    if int(h[0]+h[1]) == 3:
                        if int(h[2]+h[3]+h[4]) > 0 and int(h[2]+h[3]+h[4]) < 29:
                            print('车型：03A01黄鱼')
                            if int(h[3]+h[4]) == 1 or int(h[3]+h[4]) == 3:
                                print('上线：2002')
                            elif int(h[3]+h[4]) == 14 or int(h[3]+h[4]) == 23:
                                print('上线：2005')
                            elif int(h[3]+h[4]) > 17:
                                print('上线：2004')
                            else:
                                print('上线：2003')
                            if int(h[3]+h[4]) == 1 or int(h[3]+h[4]) == 2:
                                print('特殊性：法国进口列车')
                            elif int(h[3]+h[4]) == 3:
                                print('特殊性：曾为备件车')
                            elif int(h[3]+h[4]) == 26:
                                print('特殊性：曾为备件车')
                        elif int(h[2]+h[3]+h[4]) > 28 and int(h[2]+h[3]+h[4]) < 37:
                            print('车型：03A02黑包公')
                            if int(h[3]+h[4]) < 35:
                                print('上线：2015')
                            else:
                                print('上线：2016')
                            if int(h[3]+h[4]) < 33:
                                print('组装：长客')
                            else:
                                print('组装：SATCO')
                            if int(h[3]+h[4]) == 30:
                                print('特殊性：首列交付并上线')
                            elif int(h[3]+h[4]) == 33:
                                print('特殊性：贴纸在窗户上')
                            elif int(h[3]+h[4]) == 35:
                                print('特殊性：曾借调给4号线')
                        elif int(h[2]+h[3]+h[4]) > 36 and int(h[2]+h[3]+h[4]) < 50:
                            print('车型：04A02叛徒包公')
                            if int(h[3]+h[4]) < 47:
                                print('上线：2017')
                            else:
                                print('上线：2018')
                            print('组装：SATCO')
                            if int(h[3]+h[4]) == 38:
                                print('特殊性：首列上线')
                            elif int(h[3]+h[4]) == 48:
                                print('特殊性：最后一列上线')
                    if int(h[0]+h[1])==2:
                        if int(h[2]+h[3]+h[4])>0 and int(h[2]+h[3]+h[4])<17:
                            print('车型：02A01西瓜')
                            if int(h[3]+h[4])==1 or int(h[3]+h[4])==2 or int(h[3]+h[4])==7 or int(h[3]+h[4])==8 or int(h[3]+h[4])==11 or int(h[3]+h[4])==12 or int(h[3]+h[4])>14:
                                print('上线：2009')
                            else:
                                print('上线：2008')
                            if int(h[3]+h[4]) == 5:
                                print('特殊性：大修后全车改电动门')
                            elif int(h[3]+h[4]) == 10:
                                print('特殊性：首列扩编后上线')
                            elif int(h[3]+h[4])==15:
                                print('特殊性：最后一列扩编后上线')
                        elif int(h[2]+h[3]+h[4])>32 and int(h[2]+h[3]+h[4])<54:
                            print('车型：02A02青鱼')
                            if int(h[3]+h[4]) == 34:
                                print('特殊性：第一列交付且上线的青鱼')
                            elif int(h[3]+h[4]) == 38:
                                print('特殊性：曾为备件车')
                            elif int(h[3]+h[4]) == 43:
                                print('特殊性：纪念汶川地震曾改涂黑鱼')
                            elif int(h[3]+h[4]) == 52:
                                print('特殊性：曾为备件车')
                            if int(h[3]+h[4]) == 52 or int(h[3]+h[4]) == 53:
                                print('组装：SATCO')
                            elif int(h[3]+h[4]) % 2 == 0:
                                print('组装：SATCO')
                            elif int(h[3]+h[4]) % 2 == 1:
                                print('组装：浦镇')
                            if int(h[3]+h[4]) < 51:
                                print('上线：2008')
                            else:
                                print('上线：2009')
                        elif int(h[2]+h[3]+h[4])>53 and int(h[2]+h[3]+h[4]) <70:
                            print('车型：02A03鲶鱼')
                            if int(h[3]+h[4]) == 55:
                                print('特殊性：第一列交付，最后一列上线的鲶鱼')
                            elif int(h[3]+h[4]) == 56:
                                print('特殊性：023131、023142、023153、023201曾被拆为4节小鲶鱼')
                            elif int(h[3]+h[4]) == 64:
                                print('特殊性：第一列上线')
                            if int(h[3]+h[4]) < 62:
                                print('组装：浦镇')
                            elif (h[3]+h[4]) > 61:
                                print('组装：SATCO')
                            if int(h[3]+h[4]) == 55:
                                print('上线：2014')
                            elif int(h[3]+h[4]) == 60:
                                print('上线：2013')
                            elif int(h[3]+h[4]) == 54 or int(h[3]+h[4]) == 59 or int(h[3]+h[4]) == 61 or int(h[3]+h[4]) > 66:
                                print('上线：2012')
                            else:
                                print('上线：2010')
                        elif int(h[2]+h[3]+h[4]) > 69 and int(h[2]+h[3]+h[4]) < 86:
                            print('车型：02A04扩编鲶鱼')
                            if int(h[3]+h[4]) == 71:
                                print('上线：扩编前：2012；扩编后：2020')
                            elif int(h[3]+h[4]) == 72 or int(h[3]+h[4]) == 78:
                                print('上线：扩编前：2010；扩编后：2020')
                            elif int(h[3]+h[4]) == 74 or int(h[3]+h[4]) == 84:
                                print('上线：扩编前：2010；扩编后：2018')
                            elif int(h[3]+h[4]) == 75:
                                print('上线：扩编前：2010；扩编后：2019')
                            else:
                                print('上线：扩编前：2010；扩编后：未知')
                            if int(h[3]+h[4]) == 71:
                                print('特殊性：最后一列交付')
                            elif int(h[3]+h[4]) == 74:
                                print('特殊性：首列扩编且扩编后首列上线')
                            elif int(h[3]+h[4]) == 78:
                                print('特殊性：首列交付')
                            if int(h[3]+h[4]) < 78:
                                print('组装：浦镇；扩编车厢：浦镇')
                            else:
                                print('组装：SATCO；扩编车厢：浦镇')
                        elif int(h[2]+h[3]+h[4]) > 85 and int(h[2]+h[3]+h[4]) < 107:
                            print('车型：02A05绿灯侠')
                            if int(h[2]+h[3]+h[4]) == 86:
                                print('特殊性：首列交付')
                            elif int(h[2]+h[3]+h[4]) == 88:
                                print('特殊性：拥有上海地铁第5000节车厢，首列上线')
                            if int(h[2]+h[3]+h[4]) > 87 and int(h[2]+h[3]+h[4]) < 94:
                                print('上线：2019')
                            elif int(h[2]+h[3]+h[4]) > 95 and int(h[2]+h[3]+h[4]) < 100:
                                print('上线：2019')
                            elif int(h[2]+h[3]+h[4]) > 106 and int(h[2]+h[3]+h[4]) < 110:
                                print('上线：2019')
                            elif int(h[2]+h[3]+h[4]) == 102:
                                print('上线：2019')
                            else:
                                print('上线：2020')
                    if int(h[0]+h[1])==1:
                        if int(h[2]+h[3]+h[4])<87:
                            if int(h[3]+h[4])>0 and int(h[3]+h[4])<11:
                                print('车型：01A01老老八')
                                if int(h[3]+h[4])==2:
                                    print('上线：2011')
                                    print('特殊性：含特殊扩编车厢、曾为备件车，最后一列扩编')
                                else:
                                    print('上线：2009')
                                if int(h[3]+h[4])==1:
                                    print('特殊性：张江实训专用车')
                                elif int(h[3]+h[4])==8:
                                    print('特殊性：含国产首节A型车暨特殊修复车厢')
                                elif int(h[3]+h[4])==9:
                                    print('特殊性：现为备件车')
                            elif int(h[3]+h[4])>10 and int(h[3]+h[4])<17:
                                if int(h[3]+h[4])==14:
                                    print('车型：01A01老老八')
                                    print('上线：2009')
                                    print('特殊性：首列直改交且扩编同时进行，首列上线')
                                else:
                                    print('车型：01A02伪八二世')
                                    print('上线：2010')
                                    if int(h[3]+h[4])==13:
                                        print('特殊性：首列上线')
                                    elif int(h[3]+h[4])==16:
                                        print('特殊性：最后一列上线')
                            elif int(h[3]+h[4])>16 and int(h[3]+h[4])<26:
                                print('车型：01A03老八')
                                if int(h[3]+h[4])==17:
                                    print('上线：2012')
                                    print('特殊性：含特殊扩编车厢及修复车厢，最后一列扩编')
                                elif int(h[3]+h[4])==18:
                                    print('上线：2007')
                                    print('特殊性：首列上线')
                                elif int(h[3]+h[4])==19:
                                    print('上线：2007')
                                else:
                                    print('上线：2008')
                                if int(h[3]+h[4])==21:
                                    print('特殊性：最后一列扩编的AC01B型')
                                elif int(h[3]+h[4])==24:
                                    print('特殊性：99402车厢大修后更换为电动门')
                            elif int(h[3]+h[4])>25 and int(h[3]+h[4])<38:
                                print('车型：01A04伪八')
                                if int(h[3]+h[4])<29 or int(h[3]+h[4])==33:
                                    print('上线：2007')
                                elif int(h[3]+h[4])==37:
                                    print('上线：2009')
                                else:
                                    print('上线：2008')
                                if int(h[3]+h[4])>29:
                                    print('曾经拖车车厢在2号线')
                                elif int(h[3]+h[4]) == 26:
                                    print('特殊性：首列上线')
                                elif int(h[3]+h[4])==29:
                                    print('特殊性：此车在株机扩编')
                                elif int(h[3]+h[4])==33:
                                    print('特殊性：首列扩编并上线')
                            elif int(h[3]+h[4])>39 and int(h[3]+h[4])<56:
                                print('车型：01A05胖头鱼')
                                if int(h[3]+h[4]) == 40:
                                    print('特殊性：曾为备件车')
                                elif int(h[3]+h[4]) == 41:
                                    print('特殊性：左上角有编号、首列交付且上线')
                                elif int(h[3]+h[4]) == 50:
                                    print('特殊性：上海火车站事故车')
                                elif int(h[3]+h[4]) == 53:
                                    print('特殊性：最后一列上线')
                                if int(h[3]+h[4]) == 38 or int(h[3]+h[4]) == 39:
                                    print('组装：浦镇')
                                elif int(h[3]+h[4]) == 54 or int(h[3]+h[4]) == 55:
                                    print('组装：SATCO')
                                elif int(h[3]+h[4]) % 2 == 0:
                                    print('组装：SATCO')
                                elif int(h[3]+h[4]) % 2 == 1:
                                    print('组装：浦镇')
                                print('上线：2007')
                            elif int(h[3]+h[4])>55 and int(h[3]+h[4])<67:
                                print('车型：01A06钢铁侠')
                                if int(h[3]+h[4])==56 or int(h[3]+h[4])==58 or int(h[3]+h[4])==59 or int(h[3]+h[4])==63:
                                    print('上线：2007')
                                else:
                                    print('上线：2008')
                                if int(h[3]+h[4])==56:
                                    print('特殊性：首列上线')
                                elif int(h[3]+h[4])==57:
                                    print('特殊性：首列交付')
                                elif int(h[3]+h[4])==65:
                                    print('特殊性：最后一列交付')
                                elif int(h[3]+h[4])==66:
                                    print('特殊性：最后一列上线')
                            elif int(h[3]+h[4])>66 and int(h[3]+h[4])<87:
                                print('车型：01A07钢铁侠二世')
                                if int(h[3]+h[4])<69 or int(h[3]+h[4])>84 or int(h[3]+h[4])==82:
                                    print('上线：2020')
                                else:
                                    print('上线：2019')
                                if int(h[3]+h[4])==67:
                                    print('特殊性：最后一列交付')
                                elif int(h[3]+h[4])==69:
                                    print('特殊性：首列交付且上线')
                                elif int(h[3]+h[4])==82:
                                    print('特殊性：最后一列上线')
            except:
                if h[0] == 'T':
                    if int(h[2]+h[3]+h[4])<112 and int(h[2]+h[3]+h[4])>100:
                        print('车型：Bombardier APM 300小灰灰')
                        print('上线：2018')
                        if int(h[2]+h[3]+h[4])==101:
                            print('特殊性：首列交付')
        elif len(h)==6:
            if h[0]+h[1]=='JY':
                if int(h[3]+h[4]+h[5])>100 and int(h[3]+h[4]+h[5])<108:
                    print('车型：JY01A01')
                    print('上线：2019')
                    if int(h[3]+h[4]+h[5])==101:
                        print('特殊性：首列交付')
            elif h[0]+h[i]=='SJ':
                if int(h[3]+h[4]+h[5])>100 and int(h[3]+h[4]+h[5])<136 and int(h[5])!=4:
                    print('车型：Alstom Citadis蚕宝宝')
                    if int(h[3]+h[4]+h[5])==101:
                        print('特殊性：首列交付')
        time.sleep(time_set)
    elif a == '052011' or a == '052022':
        print('车号：501，线路：05，代号：05C01番茄炒蛋')
        print('特殊性：阿尔斯通进口列车')
        print('上线：2003')
        print('或')
        print('车号：0541，线路：05，代号：05C02紫罗兰')
        print('上线：2018')
    elif a in a1_list:
        print('车号：101，线路：01，代号：01A01老老八')
        print('特殊性：已作为张江实训车')
        print('上线：2009')
    elif a in a2_list:
        print('车号：102，线路：01，代号：01A01老老八')
        print('特殊性：含特殊扩编车厢、曾为备件车，最后一列扩编，通河新村事故车')
        print('上线：2011')
    elif a in a3_list:
        print('车号：103，线路：01，代号：01A01老老八')
        print('上线：2009')
    elif a in a4_list:
        print('车号：104，线路：01，代号：01A01老老八')
        print('上线：2009')
    elif a in a5_list:
        print('车号：105，线路：01，代号：01A01老老八')
        print('上线：2009')
    elif a in a6_list:
        print('车号：106，线路：01，代号：01A01老老八')
        print('上线：2009')
    elif a in a7_list:
        print('车号：107，线路：01，代号：01A01老老八')
        print('上线：2009')
    elif a in a8_list:
        print('车号：108，线路：01，代号：01A01老老八')
        print('特殊性：含国产首节A型车暨特殊修复车厢')
        print('上线：2009')
    elif a in a9_list:
        print('车号：109，线路：01，代号：01A01老老八')
        print('特殊性：现作备件车')
        print('上线：2009')
    elif a in a10_list:
        print('车号：110，线路：01，代号：01A01老老八')
        print('特殊性：首列直改交+扩编同时进行,首列上线')
        print('上线：2009')
    elif a in a11_list:
        print('车号：111，线路：01，代号：01A02伪八二世')
        print('特殊性：首列上线')
        print('上线：2010')
    elif a in a12_list:
        print('车号：112，线路：01，代号：01A02伪八二世')
        print('上线：2010')
    elif a in a13_list:
        print('车号：113，线路：01，代号：01A02伪八二世')
        print('上线：2010')
    elif a in a14_list:
        print('车号：114，线路：01，代号：01A01老老八')
        print('上线：2009')
    elif a in a15_list:
        print('车号：115，线路：01，代号：01A02伪八二世')
        print('上线：2010')
    elif a in a16_list:
        print('车号：116，线路：01，代号：01A02伪八二世')
        print('上线：2010')
    elif a in a17_list:
        print('车号：117，线路：01，代号：01A03老八')
        print('特殊性：含特殊扩编车厢及修复车厢，最后一列扩编')
        print('上线：2012')
    elif a in a18_list:
        print('车号：118，线路：01，代号：01A03老八')
        print('特殊性：首列上线')
        print('上线：2007')
    elif a in a19_list:
        print('车号：119，线路：01，代号：01A03老八')
        print('上线：2007')
    elif a in a20_list:
        print('车号：120，线路：01，代号：01A03老八')
        print('上线：2007')
    elif a in a21_list:
        print('车号：121，线路：01，代号：01A03老八')
        print('上线：2008')
    elif a in a22_list:
        print('车号：122，线路：01，代号：01A03老八')
        print('上线：2007')
    elif a in a23_list:
        print('车号：123，线路：01，代号：01A03老八')
        print('上线：2008')
    elif a in a24_list:
        print('车号：124，线路：01，代号：01A03老八')
        print('上线：2008')
    elif a in a25_list:
        print('车号：125，线路：01，代号：01A03老八')
        print('上线：2008')
    elif a in a26_list:
        print('车号：126，线路：01，代号：01A04伪八')
        print('特殊性：首列上线')
        print('上线：2007')
    elif a in a27_list:
        print('车号：127，线路：01，代号：01A04伪八')
        print('上线：2007')
    elif a in a28_list:
        print('车号：128，线路：01，代号：01A04伪八')
        print('上线：2007')
    elif a in a29_list:
        print('车号：129，线路：01，代号：01A04伪八')
        print('特殊性：此车在株机扩编')
        print('上线：2007')
    elif a in a30_list:
        print('车号：130，线路：01，代号：01A04伪八')
        print('特殊性：曾经拖车车厢在2号线，编号217')
        print('上线：2008')
    elif a in a31_list:
        print('车号：131，线路：01，代号：01A04伪八')
        print('特殊性：曾经拖车车厢在2号线，编号218')
        print('上线：2008')
    elif a in a32_list:
        print('车号：132，线路：01，代号：01A04伪八')
        print('特殊性：曾经拖车车厢在2号线，编号219')
        print('上线：2008')
    elif a in a33_list:
        print('车号：133，线路：01，代号：01A04伪八')
        print('特殊性：曾经拖车车厢在2号线，编号220，首列扩编且上线')
        print('上线：2007')
    elif a in a34_list:
        print('车号：134，线路：01，代号：01A04伪八')
        print('特殊性：曾经拖车车厢在2号线，编号221')
        print('上线：2008')
    elif a in a35_list:
        print('车号：135，线路：01，代号：01A04伪八')
        print('特殊性：曾经拖车车厢在2号线，编号222')
        print('上线：2008')
    elif a in a36_list:
        print('车号：136，线路：01，代号：01A04伪八')
        print('特殊性：曾经拖车车厢在2号线，编号223')
        
        print('上线：2009')
    elif a in a37_list:
        print('车号：137，线路：01，代号：01A04伪八')
        print('特殊性：曾经拖车车厢在2号线，编号224')
        print('上线：2009')

    elif a in b01_list:
        print('车号：201，线路：02，代号：02A01西瓜')
        print('上线：2008')
    elif a in b02_list:
        print('车号：202，线路：02，代号：02A01西瓜')
        print('上线：2008')
    elif a in b03_list:
        print('车号：203，线路：02，代号：02A01西瓜')
        print('上线：2008')
    elif a in b04_list:
        print('车号：204，线路：02，代号：02A01西瓜')
        print('上线：2008')
    elif a in b05_list:
        print('车号：205，线路：02，代号：02A01西瓜')
        print('特殊性：目前02005#在大修，临时与02007#调换车厢')
        print('上线：2008')
    elif a in b06_list:
        print('车号：206，线路：02，代号：02A01西瓜')
        print('上线：2008')
    elif a in b07_list:
        print('车号：207，线路：02，代号：02A01西瓜')
        print('特殊性：目前02005#在大修，临时与02005#调换车厢')
        print('上线：2009')
    elif a in b08_list:
        print('车号：208，线路：02，代号：02A01西瓜')
        print('上线：2008')
    elif a in b09_list:
        print('车号：209，线路：02，代号：02A01西瓜')
        print('上线：2008')
    elif a in b10_list:
        print('车号：210，线路：02，代号：02A01西瓜')
        print('上线：2008')
    elif a in b11_list:
        print('车号：211，线路：02，代号：02A01西瓜')
        print('上线：2008')
    elif a in b12_list:
        print('车号：212，线路：02，代号：02A01西瓜')
        print('上线：2008')
    elif a in b13_list:
        print('车号：213，线路：02，代号：02A01西瓜')
        print('上线：2008')
    elif a in b14_list:
        print('车号：214，线路：02，代号：02A01西瓜')
        print('上线：2008')
    elif a in b15_list:
        print('车号：215，线路：02，代号：02A01西瓜')
        print('上线：2009')
    elif a in b16_list:
        print('车号：216，线路：02，代号：02A01西瓜')
        print('上线：2009')
    elif a in c01_list:
        print('车号：301，线路：03，代号：03A01黄鱼')
        print('特殊性：法国进口列车')
        print('上线：2003')
    elif a in c02_list:
        print('车号：302，线路：03，代号：03A01黄鱼')
        print('特殊性：法国进口列车')
        print('上线：2003')
    elif a in c03_list:
        print('车号：303，线路：03，代号：03A01黄鱼')
        print('特殊性：曾为备件车')
        print('上线：2003')
    elif a in c04_list:
        print('车号：304，线路：03，代号：03A01黄鱼')
        print('上线：2003')
    elif a in c05_list:
        print('车号：305，线路：03，代号：03A01黄鱼')
        print('上线：2003')
    elif a in c06_list:
        print('车号：306，线路：03，代号：03A01黄鱼')
        print('上线：2003')
    elif a in c07_list:
        print('车号：307，线路：03，代号：03A01黄鱼')
        print('上线：2003')
    elif a in c08_list:
        print('车号：308，线路：03，代号：03A01黄鱼')
        print('上线：2003')
    elif a in c09_list:
        print('车号：309，线路：03，代号：03A01黄鱼')
        print('上线：2003')
    elif a in c10_list:
        print('车号：310，线路：03，代号：03A01黄鱼')
        print('上线：2003')
    elif a in c11_list:
        print('车号：311，线路：03，代号：03A01黄鱼')
        print('上线：2003')
    elif a in c12_list:
        print('车号：312，线路：03，代号：03A01黄鱼')
        print('上线：2003')
    elif a in c13_list:
        print('车号：313，线路：03，代号：03A01黄鱼')
        print('上线：2003')
    elif a in c14_list:
        print('车号：314，线路：03，代号：03A01黄鱼')
        print('上线：2003')
    elif a in c15_list:
        print('车号：315，线路：03，代号：03A01黄鱼')
        print('上线：2003')
    elif a in c16_list:
        print('车号：316，线路：03，代号：03A01黄鱼')
        print('上线：2004')
    elif a in c17_list:
        print('车号：317，线路：03，代号：03A01黄鱼')
        print('上线：2004')
    elif a in c18_list:
        print('车号：318，线路：03，代号：03A01黄鱼')
        print('上线：2004')
    elif a in c19_list:
        print('车号：319，线路：03，代号：03A01黄鱼')
        print('上线：2004')
    elif a in c20_list:
        print('车号：320，线路：03，代号：03A01黄鱼')
        print('上线：2004')
    elif a in c21_list:
        print('车号：321，线路：03，代号：03A01黄鱼')
        print('上线：2004')
    elif a in c22_list:
        print('车号：322，线路：03，代号：03A01黄鱼')
        print('上线：2004')
    elif a in c23_list:
        print('车号：323，线路：03，代号：03A01黄鱼')
        print('上线：2004')
    elif a in c24_list:
        print('车号：324，线路：03，代号：03A01黄鱼')
        print('上线：2004')
    elif a in c25_list:
        print('车号：325，线路：03，代号：03A01黄鱼')
        print('上线：2004')
    elif a in c26_list:
        print('车号：326，线路：03，代号：03A01黄鱼')
        print('特殊性：曾为备件车')
        print('上线：2004')
    elif a in c27_list:
        print('车号：327，线路：03，代号：03A01黄鱼')
        print('上线：2004')
    elif a in c28_list:
        print('车号：328，线路：03，代号：03A01黄鱼')
        print('上线：2004')
    
    elif a in e01_list:
        print('车号：501，线路：05，代号：05C01番茄炒蛋')
        print('特殊性：阿尔斯通进口列车')
        print('上线：2003')
    elif a in e02_list:
        print('车号：502，线路：05，代号：05C01番茄炒蛋')
    elif a in e03_list:
        print('车号：503，线路：05，代号：05C01番茄炒蛋')
    elif a in e04_list:
        print('车号：504，线路：05，代号：05C01番茄炒蛋')
    elif a in e05_list:
        print('车号：505，线路：05，代号：05C01番茄炒蛋')
    elif a in e06_list:
        print('车号：506，线路：05，代号：05C01番茄炒蛋')
    elif a in e07_list:
        print('车号：507，线路：05，代号：05C01番茄炒蛋')
    elif a in e08_list:
        print('车号：508，线路：05，代号：05C01番茄炒蛋')
    elif a in e09_list:
        print('车号：509，线路：05，代号：05C01番茄炒蛋')
    elif a in e10_list:
        print('车号：510，线路：05，代号：05C01番茄炒蛋')
    elif a in e11_list:
        print('车号：511，线路：05，代号：05C01番茄炒蛋')
    elif a in e12_list:
        print('车号：512，线路：05，代号：05C01番茄炒蛋')
    elif a in e13_list:
        print('车号：513，线路：05，代号：05C01番茄炒蛋')
    elif a in e15_list:
        print('车号：515，线路：05，代号：05C01番茄炒蛋')
    elif a in e16_list:
        print('车号：516，线路：05，代号：05C01番茄炒蛋')
    elif a in e17_list:
        print('车号：517，线路：05，代号：05C01番茄炒蛋')
    elif a in e18_list:
        print('车号：518，线路：05，代号：05C01番茄炒蛋，特殊性：推算编号应为514，因车号不吉利变为518')
    elif len(a) == 6 and ab < 4 and ab > 0:
        if x == '01':
            if y > 234:
                if y < 363:
                    if (y-234)%8==0 or (y-234)%8==1:
                        if ab == 1:
                            a38()
                        else:
                            print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                    elif (y-234)%8==2 or (y-234)%8==7 or (y-234)%8==4:
                        if ab == 2:
                            a38()
                        else:
                            print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                    elif (y-234)%8==3 or (y-234)%8==5 or (y-234)%8==6:
                        if ab==3:
                            a38()
                        else:
                            print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y < 556:
                    if (y-467)%8==0 or (y-467)%8==1:
                        if ab==1:
                            a56()
                        else:
                            print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                    elif (y-467)%8==2 or (y-467)%8==4 or (y-467)%8==7:
                        if ab==2:
                            a56()
                        else:
                            print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                    elif (y-467)%8==3 or (y-467)%8==5 or (y-467)%8==6:
                        if ab==3:
                            a56()
                        else:
                            print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y < 716:
                    if (y-467)%8==0 or (y-467)%8==1:
                        if ab==1:
                            a67()
                        else:
                            print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                    elif (y-467)%8==2 or (y-467)%8==4 or (y-467)%8==7:
                        if ab==2:
                            a67()
                        else:
                            print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                    elif (y-467)%8==3 or (y-467)%8==5 or (y-467)%8==6:
                        if ab==3:
                            a67()
                        else:
                            print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                else:
                    print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            else:
                print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
        elif x == '02':
            if y > 128:
                if y < 297:
                    if y%8==0 or y%8==1:
                        if ab == 1:
                            b33()
                        else:
                            print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                    elif y%8==2 or y%8==7 or y%8==4:
                        if ab == 2:
                            b33()
                        else:
                            print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                    elif y%8==3 or y%8==5 or y%8==6:
                        if ab==3:
                            b33()
                        else:
                            print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y < 425:
                    if y%8==0 or y%8==1:
                        if ab == 1:
                            b54()
                        else:
                            print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                    elif y%8==2 or y%8==3 or y%8==5 or y%8==7:
                        if ab == 2:
                            b54()
                        else:
                            print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                    elif y%8==4 or y%8==6:
                        if ab==3:
                            b54()
                        else:
                            print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y < 489:
                    if y%4==0 or y%4==1:
                        if ab == 1:
                            b70()
                        else:
                            print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                    elif y%4==2 or y%4==3:
                        if ab == 2:
                            b70()
                        else:
                            print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y < 553:
                    if ab==y%2+2:
                        b702()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y < 801:
                    if y%8==0 or y%8==1:
                        if ab == 1:
                            b86()
                        else:
                            print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                    elif y%8==2 or y%8==7 or y%8==4:
                        if ab == 2:
                            b86()
                        else:
                            print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                    elif y%8==3 or y%8==5 or y%8==6:
                        if ab==3:
                            b86()
                        else:
                            print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                else:
                    print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            else:
                print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
        elif x == '03':
            if y < 217:
                if y  > 168:
                    if y%6==0 or y%6==1:
                        if ab == 1:
                            c29()
                        else:
                            print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                    elif y%6==2 or y%6==5:
                        if ab == 2:
                            c29()
                        else:
                            print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                    elif y%6==3 or y%6==4:
                        if ab==3:
                            c29()
                        else:
                            print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                    
                else:
                    print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            else:
                print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
        elif x=='04':
            if y<169 and y > 0:
                if y%6==0 or y%6==1:
                    if ab == 1:
                        d01()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==2 or y%6==5:
                    if ab == 2:
                        d01()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==3 or y%6==4:
                    if ab==3:
                        d01()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            elif y<331 and y > 0:
                if y%6==0 or y%6==1:
                    if ab == 1:
                        d29()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==2 or y%6==5:
                    if ab == 2:
                        d29()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==3 or y%6==4:
                    if ab==3:
                        d29()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            else:
                print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
        elif x == '05':
            if y > 68:
                if y < 267:
                    if (y-68)%6==0 or (y-68)%6==1:
                        if ab == 1:
                            e19()
                        else:
                            print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                    elif (y-68)%6==2 or (y-68)%6==5:
                        if ab == 2:
                            e19()
                        else:
                            print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                    elif (y-68)%6==3 or (y-68)%6==4:
                        if ab==3:
                            e19()
                        else:
                            print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                else:
                    print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            else:
                print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
        elif x == '16':
            if y < 139 and y > 0:
                if y%3==0 or y%3==1:
                    if ab == 1:
                        p01()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%3==2:
                    if ab == 3:
                        p01()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            elif y < 229 and y > 0:
                if y%6==0 or y%6==1:
                    if ab == 1:
                        p47()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==2 or y%6==5:
                    if ab == 2:
                        p47()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==3 or y%6==4:
                    if ab==3:
                        p47()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            else:
                print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')


        elif x == '06':
            if y < 13 and y > 0:
                if y%4==0 or y%4==1:
                    if ab == 1:
                        f01()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%4==2 or y%4==3:
                    if ab == 2:
                        f01()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            elif y < 49 and y > 0:
                if y%4==0 or y%4==1:
                    if ab == 1:
                        f05()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%4==2 or y%4==3:
                    if ab == 2:
                        f05()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            elif y < 85 and y > 0:
                if y%4==0 or y%4==1:
                    if ab == 1:
                        f15()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%4==2 or y%4==3:
                    if ab == 2:
                        f15()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            elif y < 120 and y > 0:
                if y%4==0 or y%4==1:
                    if ab == 1:
                        f25()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%4==2 or y%4==3:
                    if ab == 2:
                        f25()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            elif y < 129 and y > 0:
                if y%4==0 or y%4==1:
                    if ab == 1:
                        f35()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%4==2 or y%4==3:
                    if ab == 2:
                        f35()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            elif y < 157 and y > 0:
                if y%4==0 or y%4==1:
                    if ab == 1:
                        f37()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%4==2 or y%4==3:
                    if ab == 2:
                        f37()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            elif y < 193 and y > 0:
                if y%4==0 or y%4==1:
                    if ab == 1:
                        f45()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%4==2 or y%4==3:
                    if ab == 2:
                        f45()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            elif y < 201 and y > 0:
                if y%4==0 or y%4==1:
                    if ab == 1:
                        f55()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%4==2 or y%4==3:
                    if ab == 2:
                        f55()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            elif y < 305 and y > 0:
                if y%4==0 or y%4==1:
                    if ab == 1:
                        f57()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%4==2 or y%4==3:
                    if ab == 2:
                        f57()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            else:
                print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
        elif x=='07':
            if y<253 and y > 0:
                if y%6==0 or y%6==1:
                    if ab == 1:
                        g01()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==2 or y%6==5:
                    if ab == 2:
                        g01()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==3 or y%6==4:
                    if ab==3:
                        g01()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                else:
                    print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            elif y<433 and y > 0:
                if y%6==0 or y%6==1:
                    if ab == 1:
                        g43()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==2 or y%6==5:
                    if ab == 2:
                        g43()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==3 or y%6==4:
                    if ab==3:
                        g43()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                else:
                    print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            elif y<475 and y > 0:
                if y%6==0 or y%6==1:
                    if ab == 1:
                        g73()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==2 or y%6==5:
                    if ab == 2:
                        g73()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==3 or y%6==4:
                    if ab==3:
                        g73()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                else:
                    print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            else:
                print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
        elif x=='08':
            if y<169 and y > 0:
                if y%6==0 or y%6==1:
                    if ab == 1:
                        h01()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==2 or y%6==5:
                    if ab == 2:
                        h01()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==3 or y%6==4:
                    if ab==3:
                        h01()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                else:
                    print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            elif y<295 and y > 0:
                if y%7==0 or y%7==1:
                    if ab == 1:
                        h29()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%7==2 or y%7==6:
                    if ab == 2:
                        h29()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%7==3 or y%7==4 or y%7==5:
                    if ab==3:
                        h29()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                else:
                    print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            elif y<435 and y > 0:
                if y%7==0 or y%7==1:
                    if ab == 1:
                        h47()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%7==2 or y%7==6:
                    if ab == 2:
                        h47()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%7==3 or y%7==4 or y%7==5:
                    if ab==3:
                        h47()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                else:
                    print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            elif y<603 and y > 0:
                if y%7==0 or y%7==1:
                    if ab == 1:
                        h67()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%7==2 or y%7==6:
                    if ab == 2:
                        h67()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%7==3 or y%7==4 or y%7==5:
                    if ab==3:
                        h67()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                else:
                    print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            else:
                print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
        elif x == '09':
            if y < 61 and y > 0:
                if y%6==0 or y%6==1:
                    if ab == 1:
                        i01()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==2 or y%6==5:
                    if ab == 2:
                        i01()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==3 or y%6==4:
                    if ab==3:
                        i01()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                else:
                    print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            elif y < 307 and y > 0:
                if y%6==0 or y%6==1:
                    if ab == 1:
                        i11()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==2 or y%6==5:
                    if ab == 2:
                        i11()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==3 or y%6==4:
                    if ab==3:
                        i11()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                else:
                    print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            elif y < 312 and y > 0:
                if y%6==0 or y%6==1:
                    if ab == 1:
                        i52()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==2 or y%6==5:
                    if ab == 2:
                        i52()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==3 or y%6==4:
                    if ab==3:
                        i52()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                else:
                    print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            elif y < 529 and y > 0:
                if y%6==0 or y%6==1:
                    if ab == 1:
                        i53()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==2 or y%6==5:
                    if ab == 2:
                        i53()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==3 or y%6==4:
                    if ab==3:
                        i53()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                else:
                    print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            elif y < 631 and y > 0:
                if y%6==0 or y%6==1:
                    if ab == 1:
                        i89()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==2 or y%6==5:
                    if ab == 2:
                        i89()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==3 or y%6==4:
                    if ab==3:
                        i89()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                else:
                    print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            else:
                print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
        elif x == '10':
            if y < 247 and y > 0:
                if y%6==0 or y%6==1:
                    if ab == 1:
                        j01()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==2 or y%6==5:
                    if ab == 2:
                        j01()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==3 or y%6==4:
                    if ab==3:
                        j01()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                else:
                    print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            elif y < 403 and y > 0:
                if y%6==0 or y%6==1:
                    if ab == 1:
                        j42()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==2 or y%6==5:
                    if ab == 2:
                        j42()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==3 or y%6==4:
                    if ab==3:
                        j42()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                else:
                    print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
        elif x=='11':
            if y <397 and y > 0:
                if y%6==0 or y%6==1:
                    if ab == 1:
                        k01()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==2 or y%6==5:
                    if ab == 2:
                        k01()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==3 or y%6==4:
                    if ab==3:
                        k01()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                else:
                    print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            elif y <433 and y > 0:
                if y%6==0 or y%6==1:
                    if ab == 1:
                        k67()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==2 or y%6==5:
                    if ab == 2:
                        k67()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==3 or y%6==4:
                    if ab==3:
                        k67()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                else:
                    print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            elif y<493 and y > 0:
                if y%6==0 or y%6==1:
                    if ab == 1:
                        k73()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==2 or y%6==5:
                    if ab == 2:
                        k73()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==3 or y%6==4:
                    if ab==3:
                        k73()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                else:
                    print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            else:
                print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！') 
        elif x == '12':
            if y <246 and y > 0:
                if y%6==0 or y%6==1:
                    if ab == 1:
                        l01()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==2 or y%6==5:
                    if ab == 2:
                        l01()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==3 or y%6==4:
                    if ab==3:
                        l01()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                else:
                    print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            elif y < 336 and y > 0:
                if y%6==0 or y%6==1:
                    if ab == 1:
                        l42()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==2 or y%6==5:
                    if ab == 2:
                        l42()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==3 or y%6==4:
                    if ab==3:
                        l42()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                else:
                    print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            elif y < 451 and y > 0:
                if y%6==0 or y%6==1:
                    if ab == 1:
                        l57()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==2 or y%6==5:
                    if ab == 2:
                        l57()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==3 or y%6==4:
                    if ab==3:
                        l57()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                else:
                    print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            else:
                print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
        elif x == '13':
            if y < 145 and y > 0:
                if y%6==0 or y%6==1:
                    if ab == 1:
                        m01()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==2 or y%6==5:
                    if ab == 2:
                        m01()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==3 or y%6==4:
                    if ab==3:
                        m01()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                else:
                    print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            elif y < 373 and y > 0:
                if y%6==0 or y%6==1:
                    if ab == 1:
                        m25()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==2 or y%6==5:
                    if ab == 2:
                        m25()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==3 or y%6==4:
                    if ab==3:
                        m25()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                else:
                    print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            else:
                print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')

        elif x == '14':
            if y < 393 and y > 0:
                if y%8==0 or y%8==1:
                    if ab == 1:
                        n01()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%8==2 or y%8==4 or y%8==7:
                    if ab == 2:
                        n01()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%8==3 or y%8==5 or y%8==6:
                    if ab==3:
                        n01()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                else:
                    print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            else:
                print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
        elif x == '15':
            if y < 325 and y > 0:
                if y%6==0 or y%6==1:
                    if ab == 1:
                        o01()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==2 or y%6==5:
                    if ab == 2:
                        o01()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==3 or y%6==4:
                    if ab==3:
                        o01()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                else:
                    print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            else:
                print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
        elif x == '18':
            if y < 301 and y > 0:
                if y%6==0 or y%6==1:
                    if ab == 1:
                        r01()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==2 or y%6==5:
                    if ab == 2:
                        r01()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==3 or y%6==4:
                    if ab==3:
                        r01()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                else:
                    print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            else:
                print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
        elif x == '17':
            if y < 169 and y > 0:
                if y%6==0 or y%6==1:
                    if ab == 1:
                        q01()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==2 or y%6==5:
                    if ab == 2:
                        q01()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif y%6==3 or y%6==4:
                    if ab==3:
                        q01()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                else:
                    print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            else:
                print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
        else:
            print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
        
    elif len(a) == 6 and ab < 5:
        if ab < 4:
            if x == '17':
                if y < 169 and y > 0:
                    if y%6==0 or y%6==1:
                        if ab == 1:
                            g73()
                        else:
                            print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                    elif y%6==2 or y%6==5:
                        if ab == 2:
                            g73()
                        else:
                            print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                    elif y%6==3 or y%6==4:
                        if ab==3:
                            g73()
                        else:
                            print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                    
                else:
                    print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            else:
                print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
        elif ab == 4:
            if a == '170044':
                if b[4] == '4':
                    q01()
                else:
                    print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            else:
                print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
        else:
            print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                  
    elif len(a) == 7 and ab < 4:
        if x == 'T0':
            if w < 105 and w > 0:
                if w%4==0 or w%4==1:
                    if ab==1:
                        PJX()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif w%4==2 or w%4==3:
                    if ab==2:
                        PJX()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                else:
                    print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            else:
                print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            
        else:
            print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
    elif len(a) == 8 and ab < 4:
        if x == 'JY':
            if v < 29 and v > 0:
                if v%4==0 or v%4==1:
                    if ab==1:
                        JY()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif v%4==2 or v%4==3:
                    if ab==2:
                        JY()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                else:
                    print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            else:
                print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            
        elif x == 'SJ':
            if v < 16 and v > 0:
                if v%5==0 or v%5==1:
                    if ab==1:
                        SJYGDC01()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif v%5==2 or v%5==4:
                    if ab==2:
                        SJYGDC01()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif v%5==3:
                    if ab==2:
                        SJYGDC01()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                else:
                    print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            elif v < 56 and v > 0:
                if v%5==0 or v%5==1:
                    if ab==1:
                        SJYGDC05()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif v%5==2 or v%5==4:
                    if ab==2:
                        SJYGDC05()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif v%5==3:
                    if ab==2:
                        SJYGDC05()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                else:
                    print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            elif v < 101 and v > 0:
                if v%5==0 or v%5==1:
                    if ab==1:
                        SJYGDC15()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif v%5==2 or v%5==4:
                    if ab==2:
                        SJYGDC15()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif v%5==3:
                    if ab==2:
                        SJYGDC15()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                else:
                    print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            elif v < 146 and v > 0:
                if v%5==0 or v%5==1:
                    if ab==1:
                        SJYGDC25()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif v%5==2 or v%5==4:
                    if ab==2:
                        SJYGDC25()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif v%5==3:
                    if ab==2:
                        SJYGDC25()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                else:
                    print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            elif v < 151 and v > 0:
                if v%5==0 or v%5==1:
                    if ab==1:
                        SJYGDC35()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif v%5==2 or v%5==4:
                    if ab==2:
                        SJYGDC35()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                elif v%5==3:
                    if ab==2:
                        SJYGDC35()
                    else:
                        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
                else:
                    print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            else:
                print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
            
        else:
            print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')            
    else:
        print('没有找到车体号 '+a+' ，请检查你的车体号是否正确。注意：一定不要把车厢号当作车体号！')
    time.sleep(time_set)
    print()
    time.sleep(0.1)
    
    try:
        if answer_shezhi == 'a = T' and m == '设置':
            print('感谢你们使用我们的车体号计算程序。copyright:Rain&Thomas_Tzc&小袁。感谢lolo_often提供部分技术支持，alstomfish&wxy提供列表。')
        else:
            print('感谢你们使用我们的车体号计算程序。copyright:Rain&Thomas_Tzc&小袁。感谢lolo_often提供部分技术支持，alstomfish&wxy提供列表。有任何疑问（如代码运行错误、运行不正确等，请咨询Rain: rain02095@qq.com）向上翻找可以查询本次查询记录。')
    except:
        print('感谢你们使用我们的车体号计算程序。copyright:Rain&Thomas_Tzc&小袁。感谢lolo_often提供部分技术支持，alstomfish&wxy提供列表。有任何疑问（如代码运行错误、运行不正确等，请咨询Rain: rain02095@qq.com）向上翻找可以查询本次查询记录。')
    for i in range(5):
        print('')
